MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
// Register: T7GPPS
#define T7GPPS T7GPPS
extern volatile unsigned char           T7GPPS              __at(0xDFC);
#ifndef _LIB_BUILD
asm("T7GPPS equ 0DFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T7GPPS                 :6;
    };
    struct {
        unsigned T7GPPS0                :1;
        unsigned T7GPPS1                :1;
        unsigned T7GPPS2                :1;
        unsigned T7GPPS3                :1;
        unsigned T7GPPS4                :1;
        unsigned T7GPPS5                :1;
    };
} T7GPPSbits_t;
extern volatile T7GPPSbits_t T7GPPSbits __at(0xDFC);
// bitfield macros
#define _T7GPPS_PIN_POSN                                    0x0
#define _T7GPPS_PIN_POSITION                                0x0
#define _T7GPPS_PIN_SIZE                                    0x3
#define _T7GPPS_PIN_LENGTH                                  0x3
#define _T7GPPS_PIN_MASK                                    0x7
#define _T7GPPS_PORT_POSN                                   0x3
#define _T7GPPS_PORT_POSITION                               0x3
#define _T7GPPS_PORT_SIZE                                   0x3
#define _T7GPPS_PORT_LENGTH                                 0x3
#define _T7GPPS_PORT_MASK                                   0x38
#define _T7GPPS_T7GPPS_POSN                                 0x0
#define _T7GPPS_T7GPPS_POSITION                             0x0
#define _T7GPPS_T7GPPS_SIZE                                 0x6
#define _T7GPPS_T7GPPS_LENGTH                               0x6
#define _T7GPPS_T7GPPS_MASK                                 0x3F
#define _T7GPPS_T7GPPS0_POSN                                0x0
#define _T7GPPS_T7GPPS0_POSITION                            0x0
#define _T7GPPS_T7GPPS0_SIZE                                0x1
#define _T7GPPS_T7GPPS0_LENGTH                              0x1
#define _T7GPPS_T7GPPS0_MASK                                0x1
#define _T7GPPS_T7GPPS1_POSN                                0x1
#define _T7GPPS_T7GPPS1_POSITION                            0x1
#define _T7GPPS_T7GPPS1_SIZE                                0x1
#define _T7GPPS_T7GPPS1_LENGTH                              0x1
#define _T7GPPS_T7GPPS1_MASK                                0x2
#define _T7GPPS_T7GPPS2_POSN                                0x2
#define _T7GPPS_T7GPPS2_POSITION                            0x2
#define _T7GPPS_T7GPPS2_SIZE                                0x1
#define _T7GPPS_T7GPPS2_LENGTH                              0x1
#define _T7GPPS_T7GPPS2_MASK                                0x4
#define _T7GPPS_T7GPPS3_POSN                                0x3
#define _T7GPPS_T7GPPS3_POSITION                            0x3
#define _T7GPPS_T7GPPS3_SIZE                                0x1
#define _T7GPPS_T7GPPS3_LENGTH                              0x1
#define _T7GPPS_T7GPPS3_MASK                                0x8
#define _T7GPPS_T7GPPS4_POSN                                0x4
#define _T7GPPS_T7GPPS4_POSITION                            0x4
#define _T7GPPS_T7GPPS4_SIZE                                0x1
#define _T7GPPS_T7GPPS4_LENGTH                              0x1
#define _T7GPPS_T7GPPS4_MASK                                0x10
#define _T7GPPS_T7GPPS5_POSN                                0x5
#define _T7GPPS_T7GPPS5_POSITION                            0x5
#define _T7GPPS_T7GPPS5_SIZE                                0x1
#define _T7GPPS_T7GPPS5_LENGTH                              0x1
#define _T7GPPS_T7GPPS5_MASK                                0x20

// Register: T2INPPS
#define T2INPPS T2INPPS
extern volatile unsigned char           T2INPPS             __at(0xDFD);
#ifndef _LIB_BUILD
asm("T2INPPS equ 0DFDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T2INPPS                :6;
    };
    struct {
        unsigned T2INPPS0               :1;
        unsigned T2INPPS1               :1;
        unsigned T2INPPS2               :1;
        unsigned T2INPPS3               :1;
        unsigned T2INPPS4               :1;
    };
} T2INPPSbits_t;
extern volatile T2INPPSbits_t T2INPPSbits __at(0xDFD);
// bitfield macros
#define _T2INPPS_PIN_POSN                                   0x0
#define _T2INPPS_PIN_POSITION                               0x0
#define _T2INPPS_PIN_SIZE                                   0x3
#define _T2INPPS_PIN_LENGTH                                 0x3
#define _T2INPPS_PIN_MASK                                   0x7
#define _T2INPPS_PORT_POSN                                  0x3
#define _T2INPPS_PORT_POSITION                              0x3
#define _T2INPPS_PORT_SIZE                                  0x2
#define _T2INPPS_PORT_LENGTH                                0x2
#define _T2INPPS_PORT_MASK                                  0x18
#define _T2INPPS_T2INPPS_POSN                               0x0
#define _T2INPPS_T2INPPS_POSITION                           0x0
#define _T2INPPS_T2INPPS_SIZE                               0x6
#define _T2INPPS_T2INPPS_LENGTH                             0x6
#define _T2INPPS_T2INPPS_MASK                               0x3F
#define _T2INPPS_T2INPPS0_POSN                              0x0
#define _T2INPPS_T2INPPS0_POSITION                          0x0
#define _T2INPPS_T2INPPS0_SIZE                              0x1
#define _T2INPPS_T2INPPS0_LENGTH                            0x1
#define _T2INPPS_T2INPPS0_MASK                              0x1
#define _T2INPPS_T2INPPS1_POSN                              0x1
#define _T2INPPS_T2INPPS1_POSITION                          0x1
#define _T2INPPS_T2INPPS1_SIZE                              0x1
#define _T2INPPS_T2INPPS1_LENGTH                            0x1
#define _T2INPPS_T2INPPS1_MASK                              0x2
#define _T2INPPS_T2INPPS2_POSN                              0x2
#define _T2INPPS_T2INPPS2_POSITION                          0x2
#define _T2INPPS_T2INPPS2_SIZE                              0x1
#define _T2INPPS_T2INPPS2_LENGTH                            0x1
#define _T2INPPS_T2INPPS2_MASK                              0x4
#define _T2INPPS_T2INPPS3_POSN                              0x3
#define _T2INPPS_T2INPPS3_POSITION                          0x3
#define _T2INPPS_T2INPPS3_SIZE                              0x1
#define _T2INPPS_T2INPPS3_LENGTH                            0x1
#define _T2INPPS_T2INPPS3_MASK                              0x8
#define _T2INPPS_T2INPPS4_POSN                              0x4
#define _T2INPPS_T2INPPS4_POSITION                          0x4
#define _T2INPPS_T2INPPS4_SIZE                              0x1
#define _T2INPPS_T2INPPS4_LENGTH                            0x1
#define _T2INPPS_T2INPPS4_MASK                              0x10

// Register: T4INPPS
#define T4INPPS T4INPPS
extern volatile unsigned char           T4INPPS             __at(0xDFE);
#ifndef _LIB_BUILD
asm("T4INPPS equ 0DFEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :3;
    };
    struct {
        unsigned T4INPPS                :6;
    };
    struct {
        unsigned T4INPPS0               :1;
        unsigned T4INPPS1               :1;
        unsigned T4INPPS2               :1;
        unsigned T4INPPS3               :1;
        unsigned T4INPPS4               :1;
        unsigned T4INPPS5               :1;
    };
} T4INPPSbits_t;
extern volatile T4INPPSbits_t T4INPPSbits __at(0xDFE);
// bitfield macros
#define _T4INPPS_PIN_POSN                                   0x0
#define _T4INPPS_PIN_POSITION                               0x0
#define _T4INPPS_PIN_SIZE                                   0x3
#define _T4INPPS_PIN_LENGTH                                 0x3
#define _T4INPPS_PIN_MASK                                   0x7
#define _T4INPPS_PORT_POSN                                  0x3
#define _T4INPPS_PORT_POSITION                              0x3
#define _T4INPPS_PORT_SIZE                                  0x3
#define _T4INPPS_PORT_LENGTH                                0x3
#define _T4INPPS_PORT_MASK                                  0x38
#define _T4INPPS_T4INPPS_POSN                               0x0
#define _T4INPPS_T4INPPS_POSITION                           0x0
#define _T4INPPS_T4INPPS_SIZE                               0x6
#define _T4INPPS_T4INPPS_LENGTH                             0x6
#define _T4INPPS_T4INPPS_MASK                               0x3F
#define _T4INPPS_T4INPPS0_POSN                              0x0
#define _T4INPPS_T4INPPS0_POSITION                          0x0
#define _T4INPPS_T4INPPS0_SIZE                              0x1
#define _T4INPPS_T4INPPS0_LENGTH                            0x1
#define _T4INPPS_T4INPPS0_MASK                              0x1
#define _T4INPPS_T4INPPS1_POSN                              0x1
#define _T4INPPS_T4INPPS1_POSITION                          0x1
#define _T4INPPS_T4INPPS1_SIZE                              0x1
#define _T4INPPS_T4INPPS1_LENGTH                            0x1
#define _T4INPPS_T4INPPS1_MASK                              0x2
#define _T4INPPS_T4INPPS2_POSN                              0x2
#define _T4INPPS_T4INPPS2_POSITION                          0x2
#define _T4INPPS_T4INPPS2_SIZE                              0x1
#define _T4INPPS_T4INPPS2_LENGTH                            0x1
#define _T4INPPS_T4INPPS2_MASK                              0x4
#define _T4INPPS_T4INPPS3_POSN                              0x3
#define _T4INPPS_T4INPPS3_POSITION                          0x3
#define _T4INPPS_T4INPPS3_SIZE                              0x1
#define _T4INPPS_T4INPPS3_LENGTH                            0x1
#define _T4INPPS_T4INPPS3_MASK                              0x8
#define _T4INPPS_T4INPPS4_POSN                              0x4
#define _T4INPPS_T4INPPS4_POSITION                          0x4
#define _T4INPPS_T4INPPS4_SIZE                              0x1
#define _T4INPPS_T4INPPS4_LENGTH                            0x1
#define _T4INPPS_T4INPPS4_MASK                              0x10
#define _T4INPPS_T4INPPS5_POSN                              0x5
#define _T4INPPS_T4INPPS5_POSITION                          0x5
#define _T4INPPS_T4INPPS5_SIZE                              0x1
#define _T4INPPS_T4INPPS5_LENGTH                            0x1
#define _T4INPPS_T4INPPS5_MASK                              0x20

// Register: T6INPPS
#define T6INPPS T6INPPS
extern volatile unsigned char           T6INPPS             __at(0xDFF);
#ifndef _LIB_BUILD
asm("T6INPPS equ 0DFFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned T6INPPS                :6;
    };
    struct {
        unsigned T6INPPS0               :1;
        unsigned T6INPPS1               :1;
        unsigned T6INPPS2               :1;
        unsigned T6INPPS3               :1;
        unsigned T6INPPS4               :1;
    };
} T6INPPSbits_t;
