MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0xE0F);
#ifndef _LIB_BUILD
asm("RX1PPS equ 0E0Fh");
#endif
// aliases
extern volatile unsigned char           RXPPS               __at(0xE0F);
#ifndef _LIB_BUILD
asm("RXPPS equ 0E0Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX1PPS                 :6;
    };
    struct {
        unsigned RX1PPS0                :1;
        unsigned RX1PPS1                :1;
        unsigned RX1PPS2                :1;
        unsigned RX1PPS3                :1;
        unsigned RX1PPS4                :1;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0xE0F);
// bitfield macros
#define _RX1PPS_PIN_POSN                                    0x0
#define _RX1PPS_PIN_POSITION                                0x0
#define _RX1PPS_PIN_SIZE                                    0x3
#define _RX1PPS_PIN_LENGTH                                  0x3
#define _RX1PPS_PIN_MASK                                    0x7
#define _RX1PPS_PORT_POSN                                   0x3
#define _RX1PPS_PORT_POSITION                               0x3
#define _RX1PPS_PORT_SIZE                                   0x2
#define _RX1PPS_PORT_LENGTH                                 0x2
#define _RX1PPS_PORT_MASK                                   0x18
#define _RX1PPS_RX1PPS_POSN                                 0x0
#define _RX1PPS_RX1PPS_POSITION                             0x0
#define _RX1PPS_RX1PPS_SIZE                                 0x6
#define _RX1PPS_RX1PPS_LENGTH                               0x6
#define _RX1PPS_RX1PPS_MASK                                 0x3F
#define _RX1PPS_RX1PPS0_POSN                                0x0
#define _RX1PPS_RX1PPS0_POSITION                            0x0
#define _RX1PPS_RX1PPS0_SIZE                                0x1
#define _RX1PPS_RX1PPS0_LENGTH                              0x1
#define _RX1PPS_RX1PPS0_MASK                                0x1
#define _RX1PPS_RX1PPS1_POSN                                0x1
#define _RX1PPS_RX1PPS1_POSITION                            0x1
#define _RX1PPS_RX1PPS1_SIZE                                0x1
#define _RX1PPS_RX1PPS1_LENGTH                              0x1
#define _RX1PPS_RX1PPS1_MASK                                0x2
#define _RX1PPS_RX1PPS2_POSN                                0x2
#define _RX1PPS_RX1PPS2_POSITION                            0x2
#define _RX1PPS_RX1PPS2_SIZE                                0x1
#define _RX1PPS_RX1PPS2_LENGTH                              0x1
#define _RX1PPS_RX1PPS2_MASK                                0x4
#define _RX1PPS_RX1PPS3_POSN                                0x3
#define _RX1PPS_RX1PPS3_POSITION                            0x3
#define _RX1PPS_RX1PPS3_SIZE                                0x1
#define _RX1PPS_RX1PPS3_LENGTH                              0x1
#define _RX1PPS_RX1PPS3_MASK                                0x8
#define _RX1PPS_RX1PPS4_POSN                                0x4
#define _RX1PPS_RX1PPS4_POSITION                            0x4
#define _RX1PPS_RX1PPS4_SIZE                                0x1
#define _RX1PPS_RX1PPS4_LENGTH                              0x1
#define _RX1PPS_RX1PPS4_MASK                                0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX1PPS                 :6;
    };
    struct {
        unsigned RX1PPS0                :1;
        unsigned RX1PPS1                :1;
        unsigned RX1PPS2                :1;
        unsigned RX1PPS3                :1;
        unsigned RX1PPS4                :1;
    };
} RXPPSbits_t;
extern volatile RXPPSbits_t RXPPSbits __at(0xE0F);
// bitfield macros
#define _RXPPS_PIN_POSN                                     0x0
#define _RXPPS_PIN_POSITION                                 0x0
#define _RXPPS_PIN_SIZE                                     0x3
#define _RXPPS_PIN_LENGTH                                   0x3
#define _RXPPS_PIN_MASK                                     0x7
#define _RXPPS_PORT_POSN                                    0x3
#define _RXPPS_PORT_POSITION                                0x3
#define _RXPPS_PORT_SIZE                                    0x2
#define _RXPPS_PORT_LENGTH                                  0x2
#define _RXPPS_PORT_MASK                                    0x18
#define _RXPPS_RX1PPS_POSN                                  0x0
#define _RXPPS_RX1PPS_POSITION                              0x0
#define _RXPPS_RX1PPS_SIZE                                  0x6
#define _RXPPS_RX1PPS_LENGTH                                0x6
#define _RXPPS_RX1PPS_MASK                                  0x3F
#define _RXPPS_RX1PPS0_POSN                                 0x0
#define _RXPPS_RX1PPS0_POSITION                             0x0
#define _RXPPS_RX1PPS0_SIZE                                 0x1
#define _RXPPS_RX1PPS0_LENGTH                               0x1
#define _RXPPS_RX1PPS0_MASK                                 0x1
#define _RXPPS_RX1PPS1_POSN                                 0x1
#define _RXPPS_RX1PPS1_POSITION                             0x1
#define _RXPPS_RX1PPS1_SIZE                                 0x1
#define _RXPPS_RX1PPS1_LENGTH                               0x1
#define _RXPPS_RX1PPS1_MASK                                 0x2
#define _RXPPS_RX1PPS2_POSN                                 0x2
#define _RXPPS_RX1PPS2_POSITION                             0x2
#define _RXPPS_RX1PPS2_SIZE                                 0x1
#define _RXPPS_RX1PPS2_LENGTH                               0x1
#define _RXPPS_RX1PPS2_MASK                                 0x4
#define _RXPPS_RX1PPS3_POSN                                 0x3
#define _RXPPS_RX1PPS3_POSITION                             0x3
#define _RXPPS_RX1PPS3_SIZE                                 0x1
#define _RXPPS_RX1PPS3_LENGTH                               0x1
#define _RXPPS_RX1PPS3_MASK                                 0x8
#define _RXPPS_RX1PPS4_POSN                                 0x4
#define _RXPPS_RX1PPS4_POSITION                             0x4
#define _RXPPS_RX1PPS4_SIZE                                 0x1
#define _RXPPS_RX1PPS4_LENGTH                               0x1
#define _RXPPS_RX1PPS4_MASK                                 0x10

