MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile RD6PPSbits_t RD6PPSbits __at(0xE70);
// bitfield macros
#define _RD6PPS_RD6PPS0_POSN                                0x0
#define _RD6PPS_RD6PPS0_POSITION                            0x0
#define _RD6PPS_RD6PPS0_SIZE                                0x1
#define _RD6PPS_RD6PPS0_LENGTH                              0x1
#define _RD6PPS_RD6PPS0_MASK                                0x1
#define _RD6PPS_RD6PPS1_POSN                                0x1
#define _RD6PPS_RD6PPS1_POSITION                            0x1
#define _RD6PPS_RD6PPS1_SIZE                                0x1
#define _RD6PPS_RD6PPS1_LENGTH                              0x1
#define _RD6PPS_RD6PPS1_MASK                                0x2
#define _RD6PPS_RD6PPS2_POSN                                0x2
#define _RD6PPS_RD6PPS2_POSITION                            0x2
#define _RD6PPS_RD6PPS2_SIZE                                0x1
#define _RD6PPS_RD6PPS2_LENGTH                              0x1
#define _RD6PPS_RD6PPS2_MASK                                0x4
#define _RD6PPS_RD6PPS3_POSN                                0x3
#define _RD6PPS_RD6PPS3_POSITION                            0x3
#define _RD6PPS_RD6PPS3_SIZE                                0x1
#define _RD6PPS_RD6PPS3_LENGTH                              0x1
#define _RD6PPS_RD6PPS3_MASK                                0x8
#define _RD6PPS_RD6PPS4_POSN                                0x4
#define _RD6PPS_RD6PPS4_POSITION                            0x4
#define _RD6PPS_RD6PPS4_SIZE                                0x1
#define _RD6PPS_RD6PPS4_LENGTH                              0x1
#define _RD6PPS_RD6PPS4_MASK                                0x10
#define _RD6PPS_RD6PPS5_POSN                                0x5
#define _RD6PPS_RD6PPS5_POSITION                            0x5
#define _RD6PPS_RD6PPS5_SIZE                                0x1
#define _RD6PPS_RD6PPS5_LENGTH                              0x1
#define _RD6PPS_RD6PPS5_MASK                                0x20

// Register: RD7PPS
#define RD7PPS RD7PPS
extern volatile unsigned char           RD7PPS              __at(0xE71);
#ifndef _LIB_BUILD
asm("RD7PPS equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RD7PPS0                :1;
        unsigned RD7PPS1                :1;
        unsigned RD7PPS2                :1;
        unsigned RD7PPS3                :1;
        unsigned RD7PPS4                :1;
        unsigned RD7PPS5                :1;
    };
} RD7PPSbits_t;
extern volatile RD7PPSbits_t RD7PPSbits __at(0xE71);
// bitfield macros
#define _RD7PPS_RD7PPS0_POSN                                0x0
#define _RD7PPS_RD7PPS0_POSITION                            0x0
#define _RD7PPS_RD7PPS0_SIZE                                0x1
#define _RD7PPS_RD7PPS0_LENGTH                              0x1
#define _RD7PPS_RD7PPS0_MASK                                0x1
#define _RD7PPS_RD7PPS1_POSN                                0x1
#define _RD7PPS_RD7PPS1_POSITION                            0x1
#define _RD7PPS_RD7PPS1_SIZE                                0x1
#define _RD7PPS_RD7PPS1_LENGTH                              0x1
#define _RD7PPS_RD7PPS1_MASK                                0x2
#define _RD7PPS_RD7PPS2_POSN                                0x2
#define _RD7PPS_RD7PPS2_POSITION                            0x2
#define _RD7PPS_RD7PPS2_SIZE                                0x1
#define _RD7PPS_RD7PPS2_LENGTH                              0x1
#define _RD7PPS_RD7PPS2_MASK                                0x4
#define _RD7PPS_RD7PPS3_POSN                                0x3
#define _RD7PPS_RD7PPS3_POSITION                            0x3
#define _RD7PPS_RD7PPS3_SIZE                                0x1
#define _RD7PPS_RD7PPS3_LENGTH                              0x1
#define _RD7PPS_RD7PPS3_MASK                                0x8
#define _RD7PPS_RD7PPS4_POSN                                0x4
#define _RD7PPS_RD7PPS4_POSITION                            0x4
#define _RD7PPS_RD7PPS4_SIZE                                0x1
#define _RD7PPS_RD7PPS4_LENGTH                              0x1
#define _RD7PPS_RD7PPS4_MASK                                0x10
#define _RD7PPS_RD7PPS5_POSN                                0x5
#define _RD7PPS_RD7PPS5_POSITION                            0x5
#define _RD7PPS_RD7PPS5_SIZE                                0x1
#define _RD7PPS_RD7PPS5_LENGTH                              0x1
#define _RD7PPS_RD7PPS5_MASK                                0x20

// Register: RE0PPS
#define RE0PPS RE0PPS
extern volatile unsigned char           RE0PPS              __at(0xE72);
#ifndef _LIB_BUILD
asm("RE0PPS equ 0E72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE0PPS0                :1;
        unsigned RE0PPS1                :1;
        unsigned RE0PPS2                :1;
        unsigned RE0PPS3                :1;
        unsigned RE0PPS4                :1;
        unsigned RE0PPS5                :1;
    };
} RE0PPSbits_t;
extern volatile RE0PPSbits_t RE0PPSbits __at(0xE72);
// bitfield macros
#define _RE0PPS_RE0PPS0_POSN                                0x0
#define _RE0PPS_RE0PPS0_POSITION                            0x0
#define _RE0PPS_RE0PPS0_SIZE                                0x1
#define _RE0PPS_RE0PPS0_LENGTH                              0x1
#define _RE0PPS_RE0PPS0_MASK                                0x1
#define _RE0PPS_RE0PPS1_POSN                                0x1
#define _RE0PPS_RE0PPS1_POSITION                            0x1
#define _RE0PPS_RE0PPS1_SIZE                                0x1
#define _RE0PPS_RE0PPS1_LENGTH                              0x1
#define _RE0PPS_RE0PPS1_MASK                                0x2
#define _RE0PPS_RE0PPS2_POSN                                0x2
#define _RE0PPS_RE0PPS2_POSITION                            0x2
#define _RE0PPS_RE0PPS2_SIZE                                0x1
#define _RE0PPS_RE0PPS2_LENGTH                              0x1
#define _RE0PPS_RE0PPS2_MASK                                0x4
#define _RE0PPS_RE0PPS3_POSN                                0x3
#define _RE0PPS_RE0PPS3_POSITION                            0x3
#define _RE0PPS_RE0PPS3_SIZE                                0x1
#define _RE0PPS_RE0PPS3_LENGTH                              0x1
#define _RE0PPS_RE0PPS3_MASK                                0x8
#define _RE0PPS_RE0PPS4_POSN                                0x4
#define _RE0PPS_RE0PPS4_POSITION                            0x4
#define _RE0PPS_RE0PPS4_SIZE                                0x1
#define _RE0PPS_RE0PPS4_LENGTH                              0x1
#define _RE0PPS_RE0PPS4_MASK                                0x10
#define _RE0PPS_RE0PPS5_POSN                                0x5
#define _RE0PPS_RE0PPS5_POSITION                            0x5
#define _RE0PPS_RE0PPS5_SIZE                                0x1
#define _RE0PPS_RE0PPS5_LENGTH                              0x1
#define _RE0PPS_RE0PPS5_MASK                                0x20

// Register: RE1PPS
#define RE1PPS RE1PPS
extern volatile unsigned char           RE1PPS              __at(0xE73);
#ifndef _LIB_BUILD
asm("RE1PPS equ 0E73h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE1PPS0                :1;
        unsigned RE1PPS1                :1;
        unsigned RE1PPS2                :1;
        unsigned RE1PPS3                :1;
        unsigned RE1PPS4                :1;
        unsigned RE1PPS5                :1;
    };
} RE1PPSbits_t;
extern volatile RE1PPSbits_t RE1PPSbits __at(0xE73);
// bitfield macros
#define _RE1PPS_RE1PPS0_POSN                                0x0
#define _RE1PPS_RE1PPS0_POSITION                            0x0
#define _RE1PPS_RE1PPS0_SIZE                                0x1
#define _RE1PPS_RE1PPS0_LENGTH                              0x1
#define _RE1PPS_RE1PPS0_MASK                                0x1
#define _RE1PPS_RE1PPS1_POSN                                0x1
#define _RE1PPS_RE1PPS1_POSITION                            0x1
#define _RE1PPS_RE1PPS1_SIZE                                0x1
#define _RE1PPS_RE1PPS1_LENGTH                              0x1
#define _RE1PPS_RE1PPS1_MASK                                0x2
#define _RE1PPS_RE1PPS2_POSN                                0x2
#define _RE1PPS_RE1PPS2_POSITION                            0x2
#define _RE1PPS_RE1PPS2_SIZE                                0x1
#define _RE1PPS_RE1PPS2_LENGTH                              0x1
#define _RE1PPS_RE1PPS2_MASK                                0x4
#define _RE1PPS_RE1PPS3_POSN                                0x3
#define _RE1PPS_RE1PPS3_POSITION                            0x3
#define _RE1PPS_RE1PPS3_SIZE                                0x1
#define _RE1PPS_RE1PPS3_LENGTH                              0x1
#define _RE1PPS_RE1PPS3_MASK                                0x8
#define _RE1PPS_RE1PPS4_POSN                                0x4
#define _RE1PPS_RE1PPS4_POSITION                            0x4
#define _RE1PPS_RE1PPS4_SIZE                                0x1
#define _RE1PPS_RE1PPS4_LENGTH                              0x1
#define _RE1PPS_RE1PPS4_MASK                                0x10
#define _RE1PPS_RE1PPS5_POSN                                0x5
#define _RE1PPS_RE1PPS5_POSITION                            0x5
#define _RE1PPS_RE1PPS5_SIZE                                0x1
#define _RE1PPS_RE1PPS5_LENGTH                              0x1
#define _RE1PPS_RE1PPS5_MASK                                0x20

// Register: RE2PPS
#define RE2PPS RE2PPS
extern volatile unsigned char           RE2PPS              __at(0xE74);
#ifndef _LIB_BUILD
asm("RE2PPS equ 0E74h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RE2PPS0                :1;
        unsigned RE2PPS1                :1;
        unsigned RE2PPS2                :1;
        unsigned RE2PPS3                :1;
        unsigned RE2PPS4                :1;
        unsigned RE2PPS5                :1;
    };
} RE2PPSbits_t;
extern volatile RE2PPSbits_t RE2PPSbits __at(0xE74);
// bitfield macros
#define _RE2PPS_RE2PPS0_POSN                                0x0
#define _RE2PPS_RE2PPS0_POSITION                            0x0
#define _RE2PPS_RE2PPS0_SIZE                                0x1
#define _RE2PPS_RE2PPS0_LENGTH                              0x1
#define _RE2PPS_RE2PPS0_MASK                                0x1
#define _RE2PPS_RE2PPS1_POSN                                0x1
#define _RE2PPS_RE2PPS1_POSITION                            0x1
#define _RE2PPS_RE2PPS1_SIZE                                0x1
#define _RE2PPS_RE2PPS1_LENGTH                              0x1
#define _RE2PPS_RE2PPS1_MASK                                0x2
#define _RE2PPS_RE2PPS2_POSN                                0x2
#define _RE2PPS_RE2PPS2_POSITION                            0x2
#define _RE2PPS_RE2PPS2_SIZE                                0x1
#define _RE2PPS_RE2PPS2_LENGTH                              0x1
#define _RE2PPS_RE2PPS2_MASK                                0x4
#define _RE2PPS_RE2PPS3_POSN                                0x3
#define _RE2PPS_RE2PPS3_POSITION                            0x3
#define _RE2PPS_RE2PPS3_SIZE                                0x1
#define _RE2PPS_RE2PPS3_LENGTH                              0x1
#define _RE2PPS_RE2PPS3_MASK                                0x8
#define _RE2PPS_RE2PPS4_POSN                                0x4
#define _RE2PPS_RE2PPS4_POSITION                            0x4
#define _RE2PPS_RE2PPS4_SIZE                                0x1
#define _RE2PPS_RE2PPS4_LENGTH                              0x1
#define _RE2PPS_RE2PPS4_MASK                                0x10
#define _RE2PPS_RE2PPS5_POSN                                0x5
#define _RE2PPS_RE2PPS5_POSITION                            0x5
#define _RE2PPS_RE2PPS5_SIZE                                0x1
#define _RE2PPS_RE2PPS5_LENGTH                              0x1
#define _RE2PPS_RE2PPS5_MASK                                0x20

