MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile RG2PPSbits_t RG2PPSbits __at(0xE84);
// bitfield macros
#define _RG2PPS_RG2PPS0_POSN                                0x0
#define _RG2PPS_RG2PPS0_POSITION                            0x0
#define _RG2PPS_RG2PPS0_SIZE                                0x1
#define _RG2PPS_RG2PPS0_LENGTH                              0x1
#define _RG2PPS_RG2PPS0_MASK                                0x1
#define _RG2PPS_RG2PPS1_POSN                                0x1
#define _RG2PPS_RG2PPS1_POSITION                            0x1
#define _RG2PPS_RG2PPS1_SIZE                                0x1
#define _RG2PPS_RG2PPS1_LENGTH                              0x1
#define _RG2PPS_RG2PPS1_MASK                                0x2
#define _RG2PPS_RG2PPS2_POSN                                0x2
#define _RG2PPS_RG2PPS2_POSITION                            0x2
#define _RG2PPS_RG2PPS2_SIZE                                0x1
#define _RG2PPS_RG2PPS2_LENGTH                              0x1
#define _RG2PPS_RG2PPS2_MASK                                0x4
#define _RG2PPS_RG2PPS3_POSN                                0x3
#define _RG2PPS_RG2PPS3_POSITION                            0x3
#define _RG2PPS_RG2PPS3_SIZE                                0x1
#define _RG2PPS_RG2PPS3_LENGTH                              0x1
#define _RG2PPS_RG2PPS3_MASK                                0x8
#define _RG2PPS_RG2PPS4_POSN                                0x4
#define _RG2PPS_RG2PPS4_POSITION                            0x4
#define _RG2PPS_RG2PPS4_SIZE                                0x1
#define _RG2PPS_RG2PPS4_LENGTH                              0x1
#define _RG2PPS_RG2PPS4_MASK                                0x10
#define _RG2PPS_RG2PPS5_POSN                                0x5
#define _RG2PPS_RG2PPS5_POSITION                            0x5
#define _RG2PPS_RG2PPS5_SIZE                                0x1
#define _RG2PPS_RG2PPS5_LENGTH                              0x1
#define _RG2PPS_RG2PPS5_MASK                                0x20

// Register: RG3PPS
#define RG3PPS RG3PPS
extern volatile unsigned char           RG3PPS              __at(0xE85);
#ifndef _LIB_BUILD
asm("RG3PPS equ 0E85h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG3PPS0                :1;
        unsigned RG3PPS1                :1;
        unsigned RG3PPS2                :1;
        unsigned RG3PPS3                :1;
        unsigned RG3PPS4                :1;
        unsigned RG3PPS5                :1;
    };
} RG3PPSbits_t;
extern volatile RG3PPSbits_t RG3PPSbits __at(0xE85);
// bitfield macros
#define _RG3PPS_RG3PPS0_POSN                                0x0
#define _RG3PPS_RG3PPS0_POSITION                            0x0
#define _RG3PPS_RG3PPS0_SIZE                                0x1
#define _RG3PPS_RG3PPS0_LENGTH                              0x1
#define _RG3PPS_RG3PPS0_MASK                                0x1
#define _RG3PPS_RG3PPS1_POSN                                0x1
#define _RG3PPS_RG3PPS1_POSITION                            0x1
#define _RG3PPS_RG3PPS1_SIZE                                0x1
#define _RG3PPS_RG3PPS1_LENGTH                              0x1
#define _RG3PPS_RG3PPS1_MASK                                0x2
#define _RG3PPS_RG3PPS2_POSN                                0x2
#define _RG3PPS_RG3PPS2_POSITION                            0x2
#define _RG3PPS_RG3PPS2_SIZE                                0x1
#define _RG3PPS_RG3PPS2_LENGTH                              0x1
#define _RG3PPS_RG3PPS2_MASK                                0x4
#define _RG3PPS_RG3PPS3_POSN                                0x3
#define _RG3PPS_RG3PPS3_POSITION                            0x3
#define _RG3PPS_RG3PPS3_SIZE                                0x1
#define _RG3PPS_RG3PPS3_LENGTH                              0x1
#define _RG3PPS_RG3PPS3_MASK                                0x8
#define _RG3PPS_RG3PPS4_POSN                                0x4
#define _RG3PPS_RG3PPS4_POSITION                            0x4
#define _RG3PPS_RG3PPS4_SIZE                                0x1
#define _RG3PPS_RG3PPS4_LENGTH                              0x1
#define _RG3PPS_RG3PPS4_MASK                                0x10
#define _RG3PPS_RG3PPS5_POSN                                0x5
#define _RG3PPS_RG3PPS5_POSITION                            0x5
#define _RG3PPS_RG3PPS5_SIZE                                0x1
#define _RG3PPS_RG3PPS5_LENGTH                              0x1
#define _RG3PPS_RG3PPS5_MASK                                0x20

// Register: RG4PPS
#define RG4PPS RG4PPS
extern volatile unsigned char           RG4PPS              __at(0xE86);
#ifndef _LIB_BUILD
asm("RG4PPS equ 0E86h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG4PPS0                :1;
        unsigned RG4PPS1                :1;
        unsigned RG4PPS2                :1;
        unsigned RG4PPS3                :1;
        unsigned RG4PPS4                :1;
        unsigned RG4PPS5                :1;
    };
} RG4PPSbits_t;
extern volatile RG4PPSbits_t RG4PPSbits __at(0xE86);
// bitfield macros
#define _RG4PPS_RG4PPS0_POSN                                0x0
#define _RG4PPS_RG4PPS0_POSITION                            0x0
#define _RG4PPS_RG4PPS0_SIZE                                0x1
#define _RG4PPS_RG4PPS0_LENGTH                              0x1
#define _RG4PPS_RG4PPS0_MASK                                0x1
#define _RG4PPS_RG4PPS1_POSN                                0x1
#define _RG4PPS_RG4PPS1_POSITION                            0x1
#define _RG4PPS_RG4PPS1_SIZE                                0x1
#define _RG4PPS_RG4PPS1_LENGTH                              0x1
#define _RG4PPS_RG4PPS1_MASK                                0x2
#define _RG4PPS_RG4PPS2_POSN                                0x2
#define _RG4PPS_RG4PPS2_POSITION                            0x2
#define _RG4PPS_RG4PPS2_SIZE                                0x1
#define _RG4PPS_RG4PPS2_LENGTH                              0x1
#define _RG4PPS_RG4PPS2_MASK                                0x4
#define _RG4PPS_RG4PPS3_POSN                                0x3
#define _RG4PPS_RG4PPS3_POSITION                            0x3
#define _RG4PPS_RG4PPS3_SIZE                                0x1
#define _RG4PPS_RG4PPS3_LENGTH                              0x1
#define _RG4PPS_RG4PPS3_MASK                                0x8
#define _RG4PPS_RG4PPS4_POSN                                0x4
#define _RG4PPS_RG4PPS4_POSITION                            0x4
#define _RG4PPS_RG4PPS4_SIZE                                0x1
#define _RG4PPS_RG4PPS4_LENGTH                              0x1
#define _RG4PPS_RG4PPS4_MASK                                0x10
#define _RG4PPS_RG4PPS5_POSN                                0x5
#define _RG4PPS_RG4PPS5_POSITION                            0x5
#define _RG4PPS_RG4PPS5_SIZE                                0x1
#define _RG4PPS_RG4PPS5_LENGTH                              0x1
#define _RG4PPS_RG4PPS5_MASK                                0x20

// Register: RG6PPS
#define RG6PPS RG6PPS
extern volatile unsigned char           RG6PPS              __at(0xE88);
#ifndef _LIB_BUILD
asm("RG6PPS equ 0E88h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG6PPS0                :1;
        unsigned RG6PPS1                :1;
        unsigned RG6PPS2                :1;
        unsigned RG6PPS3                :1;
        unsigned RG6PPS4                :1;
        unsigned RG6PPS5                :1;
    };
} RG6PPSbits_t;
extern volatile RG6PPSbits_t RG6PPSbits __at(0xE88);
// bitfield macros
#define _RG6PPS_RG6PPS0_POSN                                0x0
#define _RG6PPS_RG6PPS0_POSITION                            0x0
#define _RG6PPS_RG6PPS0_SIZE                                0x1
#define _RG6PPS_RG6PPS0_LENGTH                              0x1
#define _RG6PPS_RG6PPS0_MASK                                0x1
#define _RG6PPS_RG6PPS1_POSN                                0x1
#define _RG6PPS_RG6PPS1_POSITION                            0x1
#define _RG6PPS_RG6PPS1_SIZE                                0x1
#define _RG6PPS_RG6PPS1_LENGTH                              0x1
#define _RG6PPS_RG6PPS1_MASK                                0x2
#define _RG6PPS_RG6PPS2_POSN                                0x2
#define _RG6PPS_RG6PPS2_POSITION                            0x2
#define _RG6PPS_RG6PPS2_SIZE                                0x1
#define _RG6PPS_RG6PPS2_LENGTH                              0x1
#define _RG6PPS_RG6PPS2_MASK                                0x4
#define _RG6PPS_RG6PPS3_POSN                                0x3
#define _RG6PPS_RG6PPS3_POSITION                            0x3
#define _RG6PPS_RG6PPS3_SIZE                                0x1
#define _RG6PPS_RG6PPS3_LENGTH                              0x1
#define _RG6PPS_RG6PPS3_MASK                                0x8
#define _RG6PPS_RG6PPS4_POSN                                0x4
#define _RG6PPS_RG6PPS4_POSITION                            0x4
#define _RG6PPS_RG6PPS4_SIZE                                0x1
#define _RG6PPS_RG6PPS4_LENGTH                              0x1
#define _RG6PPS_RG6PPS4_MASK                                0x10
#define _RG6PPS_RG6PPS5_POSN                                0x5
#define _RG6PPS_RG6PPS5_POSITION                            0x5
#define _RG6PPS_RG6PPS5_SIZE                                0x1
#define _RG6PPS_RG6PPS5_LENGTH                              0x1
#define _RG6PPS_RG6PPS5_MASK                                0x20

// Register: RG7PPS
#define RG7PPS RG7PPS
extern volatile unsigned char           RG7PPS              __at(0xE89);
#ifndef _LIB_BUILD
asm("RG7PPS equ 0E89h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RG7PPS0                :1;
        unsigned RG7PPS1                :1;
        unsigned RG7PPS2                :1;
        unsigned RG7PPS3                :1;
        unsigned RG7PPS4                :1;
        unsigned RG7PPS5                :1;
    };
} RG7PPSbits_t;
