MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile RG7PPSbits_t RG7PPSbits __at(0xE89);
// bitfield macros
#define _RG7PPS_RG7PPS0_POSN                                0x0
#define _RG7PPS_RG7PPS0_POSITION                            0x0
#define _RG7PPS_RG7PPS0_SIZE                                0x1
#define _RG7PPS_RG7PPS0_LENGTH                              0x1
#define _RG7PPS_RG7PPS0_MASK                                0x1
#define _RG7PPS_RG7PPS1_POSN                                0x1
#define _RG7PPS_RG7PPS1_POSITION                            0x1
#define _RG7PPS_RG7PPS1_SIZE                                0x1
#define _RG7PPS_RG7PPS1_LENGTH                              0x1
#define _RG7PPS_RG7PPS1_MASK                                0x2
#define _RG7PPS_RG7PPS2_POSN                                0x2
#define _RG7PPS_RG7PPS2_POSITION                            0x2
#define _RG7PPS_RG7PPS2_SIZE                                0x1
#define _RG7PPS_RG7PPS2_LENGTH                              0x1
#define _RG7PPS_RG7PPS2_MASK                                0x4
#define _RG7PPS_RG7PPS3_POSN                                0x3
#define _RG7PPS_RG7PPS3_POSITION                            0x3
#define _RG7PPS_RG7PPS3_SIZE                                0x1
#define _RG7PPS_RG7PPS3_LENGTH                              0x1
#define _RG7PPS_RG7PPS3_MASK                                0x8
#define _RG7PPS_RG7PPS4_POSN                                0x4
#define _RG7PPS_RG7PPS4_POSITION                            0x4
#define _RG7PPS_RG7PPS4_SIZE                                0x1
#define _RG7PPS_RG7PPS4_LENGTH                              0x1
#define _RG7PPS_RG7PPS4_MASK                                0x10
#define _RG7PPS_RG7PPS5_POSN                                0x5
#define _RG7PPS_RG7PPS5_POSITION                            0x5
#define _RG7PPS_RG7PPS5_SIZE                                0x1
#define _RG7PPS_RG7PPS5_LENGTH                              0x1
#define _RG7PPS_RG7PPS5_MASK                                0x20

// Register: RH0PPS
#define RH0PPS RH0PPS
extern volatile unsigned char           RH0PPS              __at(0xE8A);
#ifndef _LIB_BUILD
asm("RH0PPS equ 0E8Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH0PPS0                :1;
        unsigned RH0PPS1                :1;
        unsigned RH0PPS2                :1;
        unsigned RH0PPS3                :1;
        unsigned RH0PPS4                :1;
        unsigned RH0PPS5                :1;
    };
} RH0PPSbits_t;
extern volatile RH0PPSbits_t RH0PPSbits __at(0xE8A);
// bitfield macros
#define _RH0PPS_RH0PPS0_POSN                                0x0
#define _RH0PPS_RH0PPS0_POSITION                            0x0
#define _RH0PPS_RH0PPS0_SIZE                                0x1
#define _RH0PPS_RH0PPS0_LENGTH                              0x1
#define _RH0PPS_RH0PPS0_MASK                                0x1
#define _RH0PPS_RH0PPS1_POSN                                0x1
#define _RH0PPS_RH0PPS1_POSITION                            0x1
#define _RH0PPS_RH0PPS1_SIZE                                0x1
#define _RH0PPS_RH0PPS1_LENGTH                              0x1
#define _RH0PPS_RH0PPS1_MASK                                0x2
#define _RH0PPS_RH0PPS2_POSN                                0x2
#define _RH0PPS_RH0PPS2_POSITION                            0x2
#define _RH0PPS_RH0PPS2_SIZE                                0x1
#define _RH0PPS_RH0PPS2_LENGTH                              0x1
#define _RH0PPS_RH0PPS2_MASK                                0x4
#define _RH0PPS_RH0PPS3_POSN                                0x3
#define _RH0PPS_RH0PPS3_POSITION                            0x3
#define _RH0PPS_RH0PPS3_SIZE                                0x1
#define _RH0PPS_RH0PPS3_LENGTH                              0x1
#define _RH0PPS_RH0PPS3_MASK                                0x8
#define _RH0PPS_RH0PPS4_POSN                                0x4
#define _RH0PPS_RH0PPS4_POSITION                            0x4
#define _RH0PPS_RH0PPS4_SIZE                                0x1
#define _RH0PPS_RH0PPS4_LENGTH                              0x1
#define _RH0PPS_RH0PPS4_MASK                                0x10
#define _RH0PPS_RH0PPS5_POSN                                0x5
#define _RH0PPS_RH0PPS5_POSITION                            0x5
#define _RH0PPS_RH0PPS5_SIZE                                0x1
#define _RH0PPS_RH0PPS5_LENGTH                              0x1
#define _RH0PPS_RH0PPS5_MASK                                0x20

// Register: RH1PPS
#define RH1PPS RH1PPS
extern volatile unsigned char           RH1PPS              __at(0xE8B);
#ifndef _LIB_BUILD
asm("RH1PPS equ 0E8Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH1PPS0                :1;
        unsigned RH1PPS1                :1;
        unsigned RH1PPS2                :1;
        unsigned RH1PPS3                :1;
        unsigned RH1PPS4                :1;
        unsigned RH1PPS5                :1;
    };
} RH1PPSbits_t;
extern volatile RH1PPSbits_t RH1PPSbits __at(0xE8B);
// bitfield macros
#define _RH1PPS_RH1PPS0_POSN                                0x0
#define _RH1PPS_RH1PPS0_POSITION                            0x0
#define _RH1PPS_RH1PPS0_SIZE                                0x1
#define _RH1PPS_RH1PPS0_LENGTH                              0x1
#define _RH1PPS_RH1PPS0_MASK                                0x1
#define _RH1PPS_RH1PPS1_POSN                                0x1
#define _RH1PPS_RH1PPS1_POSITION                            0x1
#define _RH1PPS_RH1PPS1_SIZE                                0x1
#define _RH1PPS_RH1PPS1_LENGTH                              0x1
#define _RH1PPS_RH1PPS1_MASK                                0x2
#define _RH1PPS_RH1PPS2_POSN                                0x2
#define _RH1PPS_RH1PPS2_POSITION                            0x2
#define _RH1PPS_RH1PPS2_SIZE                                0x1
#define _RH1PPS_RH1PPS2_LENGTH                              0x1
#define _RH1PPS_RH1PPS2_MASK                                0x4
#define _RH1PPS_RH1PPS3_POSN                                0x3
#define _RH1PPS_RH1PPS3_POSITION                            0x3
#define _RH1PPS_RH1PPS3_SIZE                                0x1
#define _RH1PPS_RH1PPS3_LENGTH                              0x1
#define _RH1PPS_RH1PPS3_MASK                                0x8
#define _RH1PPS_RH1PPS4_POSN                                0x4
#define _RH1PPS_RH1PPS4_POSITION                            0x4
#define _RH1PPS_RH1PPS4_SIZE                                0x1
#define _RH1PPS_RH1PPS4_LENGTH                              0x1
#define _RH1PPS_RH1PPS4_MASK                                0x10
#define _RH1PPS_RH1PPS5_POSN                                0x5
#define _RH1PPS_RH1PPS5_POSITION                            0x5
#define _RH1PPS_RH1PPS5_SIZE                                0x1
#define _RH1PPS_RH1PPS5_LENGTH                              0x1
#define _RH1PPS_RH1PPS5_MASK                                0x20

