MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
// Register: ANSELE
#define ANSELE ANSELE
extern volatile unsigned char           ANSELE              __at(0xEAF);
#ifndef _LIB_BUILD
asm("ANSELE equ 0EAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELE0                :1;
        unsigned ANSELE1                :1;
        unsigned ANSELE2                :1;
        unsigned ANSELE3                :1;
        unsigned ANSELE4                :1;
        unsigned ANSELE5                :1;
        unsigned ANSELE6                :1;
        unsigned ANSELE7                :1;
    };
} ANSELEbits_t;
extern volatile ANSELEbits_t ANSELEbits __at(0xEAF);
// bitfield macros
#define _ANSELE_ANSELE0_POSN                                0x0
#define _ANSELE_ANSELE0_POSITION                            0x0
#define _ANSELE_ANSELE0_SIZE                                0x1
#define _ANSELE_ANSELE0_LENGTH                              0x1
#define _ANSELE_ANSELE0_MASK                                0x1
#define _ANSELE_ANSELE1_POSN                                0x1
#define _ANSELE_ANSELE1_POSITION                            0x1
#define _ANSELE_ANSELE1_SIZE                                0x1
#define _ANSELE_ANSELE1_LENGTH                              0x1
#define _ANSELE_ANSELE1_MASK                                0x2
#define _ANSELE_ANSELE2_POSN                                0x2
#define _ANSELE_ANSELE2_POSITION                            0x2
#define _ANSELE_ANSELE2_SIZE                                0x1
#define _ANSELE_ANSELE2_LENGTH                              0x1
#define _ANSELE_ANSELE2_MASK                                0x4
#define _ANSELE_ANSELE3_POSN                                0x3
#define _ANSELE_ANSELE3_POSITION                            0x3
#define _ANSELE_ANSELE3_SIZE                                0x1
#define _ANSELE_ANSELE3_LENGTH                              0x1
#define _ANSELE_ANSELE3_MASK                                0x8
#define _ANSELE_ANSELE4_POSN                                0x4
#define _ANSELE_ANSELE4_POSITION                            0x4
#define _ANSELE_ANSELE4_SIZE                                0x1
#define _ANSELE_ANSELE4_LENGTH                              0x1
#define _ANSELE_ANSELE4_MASK                                0x10
#define _ANSELE_ANSELE5_POSN                                0x5
#define _ANSELE_ANSELE5_POSITION                            0x5
#define _ANSELE_ANSELE5_SIZE                                0x1
#define _ANSELE_ANSELE5_LENGTH                              0x1
#define _ANSELE_ANSELE5_MASK                                0x20
#define _ANSELE_ANSELE6_POSN                                0x6
#define _ANSELE_ANSELE6_POSITION                            0x6
#define _ANSELE_ANSELE6_SIZE                                0x1
#define _ANSELE_ANSELE6_LENGTH                              0x1
#define _ANSELE_ANSELE6_MASK                                0x40
#define _ANSELE_ANSELE7_POSN                                0x7
#define _ANSELE_ANSELE7_POSITION                            0x7
#define _ANSELE_ANSELE7_SIZE                                0x1
#define _ANSELE_ANSELE7_LENGTH                              0x1
#define _ANSELE_ANSELE7_MASK                                0x80

// Register: INLVLF
#define INLVLF INLVLF
extern volatile unsigned char           INLVLF              __at(0xEB0);
#ifndef _LIB_BUILD
asm("INLVLF equ 0EB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLF0                :1;
        unsigned INLVLF1                :1;
        unsigned INLVLF2                :1;
        unsigned INLVLF3                :1;
        unsigned INLVLF4                :1;
        unsigned INLVLF5                :1;
        unsigned INLVLF6                :1;
        unsigned INLVLF7                :1;
    };
} INLVLFbits_t;
extern volatile INLVLFbits_t INLVLFbits __at(0xEB0);
// bitfield macros
#define _INLVLF_INLVLF0_POSN                                0x0
#define _INLVLF_INLVLF0_POSITION                            0x0
#define _INLVLF_INLVLF0_SIZE                                0x1
#define _INLVLF_INLVLF0_LENGTH                              0x1
#define _INLVLF_INLVLF0_MASK                                0x1
#define _INLVLF_INLVLF1_POSN                                0x1
#define _INLVLF_INLVLF1_POSITION                            0x1
#define _INLVLF_INLVLF1_SIZE                                0x1
#define _INLVLF_INLVLF1_LENGTH                              0x1
#define _INLVLF_INLVLF1_MASK                                0x2
#define _INLVLF_INLVLF2_POSN                                0x2
#define _INLVLF_INLVLF2_POSITION                            0x2
#define _INLVLF_INLVLF2_SIZE                                0x1
#define _INLVLF_INLVLF2_LENGTH                              0x1
#define _INLVLF_INLVLF2_MASK                                0x4
#define _INLVLF_INLVLF3_POSN                                0x3
#define _INLVLF_INLVLF3_POSITION                            0x3
#define _INLVLF_INLVLF3_SIZE                                0x1
#define _INLVLF_INLVLF3_LENGTH                              0x1
#define _INLVLF_INLVLF3_MASK                                0x8
#define _INLVLF_INLVLF4_POSN                                0x4
#define _INLVLF_INLVLF4_POSITION                            0x4
#define _INLVLF_INLVLF4_SIZE                                0x1
#define _INLVLF_INLVLF4_LENGTH                              0x1
#define _INLVLF_INLVLF4_MASK                                0x10
#define _INLVLF_INLVLF5_POSN                                0x5
#define _INLVLF_INLVLF5_POSITION                            0x5
#define _INLVLF_INLVLF5_SIZE                                0x1
#define _INLVLF_INLVLF5_LENGTH                              0x1
#define _INLVLF_INLVLF5_MASK                                0x20
#define _INLVLF_INLVLF6_POSN                                0x6
#define _INLVLF_INLVLF6_POSITION                            0x6
#define _INLVLF_INLVLF6_SIZE                                0x1
#define _INLVLF_INLVLF6_LENGTH                              0x1
#define _INLVLF_INLVLF6_MASK                                0x40
#define _INLVLF_INLVLF7_POSN                                0x7
#define _INLVLF_INLVLF7_POSITION                            0x7
#define _INLVLF_INLVLF7_SIZE                                0x1
#define _INLVLF_INLVLF7_LENGTH                              0x1
#define _INLVLF_INLVLF7_MASK                                0x80

