MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
// Register: ANSELG
#define ANSELG ANSELG
extern volatile unsigned char           ANSELG              __at(0xEBC);
#ifndef _LIB_BUILD
asm("ANSELG equ 0EBCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSELG0                :1;
        unsigned ANSELG1                :1;
        unsigned ANSELG2                :1;
        unsigned ANSELG3                :1;
        unsigned ANSELG4                :1;
        unsigned                        :1;
        unsigned ANSELG6                :1;
        unsigned ANSELG7                :1;
    };
} ANSELGbits_t;
extern volatile ANSELGbits_t ANSELGbits __at(0xEBC);
// bitfield macros
#define _ANSELG_ANSELG0_POSN                                0x0
#define _ANSELG_ANSELG0_POSITION                            0x0
#define _ANSELG_ANSELG0_SIZE                                0x1
#define _ANSELG_ANSELG0_LENGTH                              0x1
#define _ANSELG_ANSELG0_MASK                                0x1
#define _ANSELG_ANSELG1_POSN                                0x1
#define _ANSELG_ANSELG1_POSITION                            0x1
#define _ANSELG_ANSELG1_SIZE                                0x1
#define _ANSELG_ANSELG1_LENGTH                              0x1
#define _ANSELG_ANSELG1_MASK                                0x2
#define _ANSELG_ANSELG2_POSN                                0x2
#define _ANSELG_ANSELG2_POSITION                            0x2
#define _ANSELG_ANSELG2_SIZE                                0x1
#define _ANSELG_ANSELG2_LENGTH                              0x1
#define _ANSELG_ANSELG2_MASK                                0x4
#define _ANSELG_ANSELG3_POSN                                0x3
#define _ANSELG_ANSELG3_POSITION                            0x3
#define _ANSELG_ANSELG3_SIZE                                0x1
#define _ANSELG_ANSELG3_LENGTH                              0x1
#define _ANSELG_ANSELG3_MASK                                0x8
#define _ANSELG_ANSELG4_POSN                                0x4
#define _ANSELG_ANSELG4_POSITION                            0x4
#define _ANSELG_ANSELG4_SIZE                                0x1
#define _ANSELG_ANSELG4_LENGTH                              0x1
#define _ANSELG_ANSELG4_MASK                                0x10
#define _ANSELG_ANSELG6_POSN                                0x6
#define _ANSELG_ANSELG6_POSITION                            0x6
#define _ANSELG_ANSELG6_SIZE                                0x1
#define _ANSELG_ANSELG6_LENGTH                              0x1
#define _ANSELG_ANSELG6_MASK                                0x40
#define _ANSELG_ANSELG7_POSN                                0x7
#define _ANSELG_ANSELG7_POSITION                            0x7
#define _ANSELG_ANSELG7_SIZE                                0x1
#define _ANSELG_ANSELG7_LENGTH                              0x1
#define _ANSELG_ANSELG7_MASK                                0x80

// Register: INLVLH
#define INLVLH INLVLH
extern volatile unsigned char           INLVLH              __at(0xEBD);
#ifndef _LIB_BUILD
asm("INLVLH equ 0EBDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INLVLH0                :1;
        unsigned INLVLH1                :1;
        unsigned INLVLH2                :1;
        unsigned INLVLH3                :1;
    };
} INLVLHbits_t;
extern volatile INLVLHbits_t INLVLHbits __at(0xEBD);
// bitfield macros
#define _INLVLH_INLVLH0_POSN                                0x0
#define _INLVLH_INLVLH0_POSITION                            0x0
#define _INLVLH_INLVLH0_SIZE                                0x1
#define _INLVLH_INLVLH0_LENGTH                              0x1
#define _INLVLH_INLVLH0_MASK                                0x1
#define _INLVLH_INLVLH1_POSN                                0x1
#define _INLVLH_INLVLH1_POSITION                            0x1
#define _INLVLH_INLVLH1_SIZE                                0x1
#define _INLVLH_INLVLH1_LENGTH                              0x1
#define _INLVLH_INLVLH1_MASK                                0x2
#define _INLVLH_INLVLH2_POSN                                0x2
#define _INLVLH_INLVLH2_POSITION                            0x2
#define _INLVLH_INLVLH2_SIZE                                0x1
#define _INLVLH_INLVLH2_LENGTH                              0x1
#define _INLVLH_INLVLH2_MASK                                0x4
#define _INLVLH_INLVLH3_POSN                                0x3
#define _INLVLH_INLVLH3_POSITION                            0x3
#define _INLVLH_INLVLH3_SIZE                                0x1
#define _INLVLH_INLVLH3_LENGTH                              0x1
#define _INLVLH_INLVLH3_MASK                                0x8

// Register: SLRCONH
#define SLRCONH SLRCONH
extern volatile unsigned char           SLRCONH             __at(0xEBE);
#ifndef _LIB_BUILD
asm("SLRCONH equ 0EBEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SLRH0                  :1;
        unsigned SLRH1                  :1;
        unsigned SLRH2                  :1;
        unsigned SLRH3                  :1;
    };
} SLRCONHbits_t;
extern volatile SLRCONHbits_t SLRCONHbits __at(0xEBE);
// bitfield macros
#define _SLRCONH_SLRH0_POSN                                 0x0
#define _SLRCONH_SLRH0_POSITION                             0x0
#define _SLRCONH_SLRH0_SIZE                                 0x1
#define _SLRCONH_SLRH0_LENGTH                               0x1
#define _SLRCONH_SLRH0_MASK                                 0x1
#define _SLRCONH_SLRH1_POSN                                 0x1
#define _SLRCONH_SLRH1_POSITION                             0x1
#define _SLRCONH_SLRH1_SIZE                                 0x1
#define _SLRCONH_SLRH1_LENGTH                               0x1
#define _SLRCONH_SLRH1_MASK                                 0x2
#define _SLRCONH_SLRH2_POSN                                 0x2
#define _SLRCONH_SLRH2_POSITION                             0x2
#define _SLRCONH_SLRH2_SIZE                                 0x1
#define _SLRCONH_SLRH2_LENGTH                               0x1
#define _SLRCONH_SLRH2_MASK                                 0x4
#define _SLRCONH_SLRH3_POSN                                 0x3
#define _SLRCONH_SLRH3_POSITION                             0x3
#define _SLRCONH_SLRH3_SIZE                                 0x1
#define _SLRCONH_SLRH3_LENGTH                               0x1
#define _SLRCONH_SLRH3_MASK                                 0x8

// Register: ODCONH
#define ODCONH ODCONH
extern volatile unsigned char           ODCONH              __at(0xEBF);
#ifndef _LIB_BUILD
asm("ODCONH equ 0EBFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ODCH0                  :1;
        unsigned ODCH1                  :1;
        unsigned ODCH2                  :1;
        unsigned ODCH3                  :1;
    };
} ODCONHbits_t;
extern volatile ODCONHbits_t ODCONHbits __at(0xEBF);
// bitfield macros
#define _ODCONH_ODCH0_POSN                                  0x0
#define _ODCONH_ODCH0_POSITION                              0x0
#define _ODCONH_ODCH0_SIZE                                  0x1
#define _ODCONH_ODCH0_LENGTH                                0x1
#define _ODCONH_ODCH0_MASK                                  0x1
#define _ODCONH_ODCH1_POSN                                  0x1
#define _ODCONH_ODCH1_POSITION                              0x1
#define _ODCONH_ODCH1_SIZE                                  0x1
#define _ODCONH_ODCH1_LENGTH                                0x1
#define _ODCONH_ODCH1_MASK                                  0x2
#define _ODCONH_ODCH2_POSN                                  0x2
#define _ODCONH_ODCH2_POSITION                              0x2
#define _ODCONH_ODCH2_SIZE                                  0x1
#define _ODCONH_ODCH2_LENGTH                                0x1
#define _ODCONH_ODCH2_MASK                                  0x4
#define _ODCONH_ODCH3_POSN                                  0x3
#define _ODCONH_ODCH3_POSITION                              0x3
#define _ODCONH_ODCH3_SIZE                                  0x1
#define _ODCONH_ODCH3_LENGTH                                0x1
#define _ODCONH_ODCH3_MASK                                  0x8

