MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile BAUDCON5bits_t BAUDCON5bits __at(0xEE2);
// bitfield macros
#define _BAUDCON5_ABDEN_POSN                                0x0
#define _BAUDCON5_ABDEN_POSITION                            0x0
#define _BAUDCON5_ABDEN_SIZE                                0x1
#define _BAUDCON5_ABDEN_LENGTH                              0x1
#define _BAUDCON5_ABDEN_MASK                                0x1
#define _BAUDCON5_WUE_POSN                                  0x1
#define _BAUDCON5_WUE_POSITION                              0x1
#define _BAUDCON5_WUE_SIZE                                  0x1
#define _BAUDCON5_WUE_LENGTH                                0x1
#define _BAUDCON5_WUE_MASK                                  0x2
#define _BAUDCON5_BRG16_POSN                                0x3
#define _BAUDCON5_BRG16_POSITION                            0x3
#define _BAUDCON5_BRG16_SIZE                                0x1
#define _BAUDCON5_BRG16_LENGTH                              0x1
#define _BAUDCON5_BRG16_MASK                                0x8
#define _BAUDCON5_SCKP_POSN                                 0x4
#define _BAUDCON5_SCKP_POSITION                             0x4
#define _BAUDCON5_SCKP_SIZE                                 0x1
#define _BAUDCON5_SCKP_LENGTH                               0x1
#define _BAUDCON5_SCKP_MASK                                 0x10
#define _BAUDCON5_RCIDL_POSN                                0x6
#define _BAUDCON5_RCIDL_POSITION                            0x6
#define _BAUDCON5_RCIDL_SIZE                                0x1
#define _BAUDCON5_RCIDL_LENGTH                              0x1
#define _BAUDCON5_RCIDL_MASK                                0x40
#define _BAUDCON5_ABDOVF_POSN                               0x7
#define _BAUDCON5_ABDOVF_POSITION                           0x7
#define _BAUDCON5_ABDOVF_SIZE                               0x1
#define _BAUDCON5_ABDOVF_LENGTH                             0x1
#define _BAUDCON5_ABDOVF_MASK                               0x80
typedef union {
    struct {
        unsigned ABDEN                  :1;
        unsigned WUE                    :1;
        unsigned                        :1;
        unsigned BRG16                  :1;
        unsigned SCKP                   :1;
        unsigned                        :1;
        unsigned RCIDL                  :1;
        unsigned ABDOVF                 :1;
    };
} BAUDCTL5bits_t;
extern volatile BAUDCTL5bits_t BAUDCTL5bits __at(0xEE2);
// bitfield macros
#define _BAUDCTL5_ABDEN_POSN                                0x0
#define _BAUDCTL5_ABDEN_POSITION                            0x0
#define _BAUDCTL5_ABDEN_SIZE                                0x1
#define _BAUDCTL5_ABDEN_LENGTH                              0x1
#define _BAUDCTL5_ABDEN_MASK                                0x1
#define _BAUDCTL5_WUE_POSN                                  0x1
#define _BAUDCTL5_WUE_POSITION                              0x1
#define _BAUDCTL5_WUE_SIZE                                  0x1
#define _BAUDCTL5_WUE_LENGTH                                0x1
#define _BAUDCTL5_WUE_MASK                                  0x2
#define _BAUDCTL5_BRG16_POSN                                0x3
#define _BAUDCTL5_BRG16_POSITION                            0x3
#define _BAUDCTL5_BRG16_SIZE                                0x1
#define _BAUDCTL5_BRG16_LENGTH                              0x1
#define _BAUDCTL5_BRG16_MASK                                0x8
#define _BAUDCTL5_SCKP_POSN                                 0x4
#define _BAUDCTL5_SCKP_POSITION                             0x4
#define _BAUDCTL5_SCKP_SIZE                                 0x1
#define _BAUDCTL5_SCKP_LENGTH                               0x1
#define _BAUDCTL5_SCKP_MASK                                 0x10
#define _BAUDCTL5_RCIDL_POSN                                0x6
#define _BAUDCTL5_RCIDL_POSITION                            0x6
#define _BAUDCTL5_RCIDL_SIZE                                0x1
#define _BAUDCTL5_RCIDL_LENGTH                              0x1
#define _BAUDCTL5_RCIDL_MASK                                0x40
#define _BAUDCTL5_ABDOVF_POSN                               0x7
#define _BAUDCTL5_ABDOVF_POSITION                           0x7
#define _BAUDCTL5_ABDOVF_SIZE                               0x1
#define _BAUDCTL5_ABDOVF_LENGTH                             0x1
#define _BAUDCTL5_ABDOVF_MASK                               0x80

// Register: RC4REG
#define RC4REG RC4REG
extern volatile unsigned char           RC4REG              __at(0xEE3);
#ifndef _LIB_BUILD
asm("RC4REG equ 0EE3h");
#endif
// aliases
extern volatile unsigned char           RCREG4              __at(0xEE3);
#ifndef _LIB_BUILD
asm("RCREG4 equ 0EE3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC4REG                 :8;
    };
} RC4REGbits_t;
extern volatile RC4REGbits_t RC4REGbits __at(0xEE3);
// bitfield macros
#define _RC4REG_RC4REG_POSN                                 0x0
#define _RC4REG_RC4REG_POSITION                             0x0
#define _RC4REG_RC4REG_SIZE                                 0x8
#define _RC4REG_RC4REG_LENGTH                               0x8
#define _RC4REG_RC4REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC4REG                 :8;
    };
} RCREG4bits_t;
extern volatile RCREG4bits_t RCREG4bits __at(0xEE3);
// bitfield macros
#define _RCREG4_RC4REG_POSN                                 0x0
#define _RCREG4_RC4REG_POSITION                             0x0
#define _RCREG4_RC4REG_SIZE                                 0x8
#define _RCREG4_RC4REG_LENGTH                               0x8
#define _RCREG4_RC4REG_MASK                                 0xFF

// Register: TX4REG
#define TX4REG TX4REG
extern volatile unsigned char           TX4REG              __at(0xEE4);
#ifndef _LIB_BUILD
asm("TX4REG equ 0EE4h");
#endif
// aliases
extern volatile unsigned char           TXREG4              __at(0xEE4);
#ifndef _LIB_BUILD
asm("TXREG4 equ 0EE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX4REG                 :8;
    };
} TX4REGbits_t;
