MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile TX4REGbits_t TX4REGbits __at(0xEE4);
// bitfield macros
#define _TX4REG_TX4REG_POSN                                 0x0
#define _TX4REG_TX4REG_POSITION                             0x0
#define _TX4REG_TX4REG_SIZE                                 0x8
#define _TX4REG_TX4REG_LENGTH                               0x8
#define _TX4REG_TX4REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX4REG                 :8;
    };
} TXREG4bits_t;
extern volatile TXREG4bits_t TXREG4bits __at(0xEE4);
// bitfield macros
#define _TXREG4_TX4REG_POSN                                 0x0
#define _TXREG4_TX4REG_POSITION                             0x0
#define _TXREG4_TX4REG_SIZE                                 0x8
#define _TXREG4_TX4REG_LENGTH                               0x8
#define _TXREG4_TX4REG_MASK                                 0xFF

// Register: SP4BRG
#define SP4BRG SP4BRG
extern volatile unsigned short          SP4BRG              __at(0xEE5);
#ifndef _LIB_BUILD
asm("SP4BRG equ 0EE5h");
#endif

// Register: SP4BRGL
#define SP4BRGL SP4BRGL
extern volatile unsigned char           SP4BRGL             __at(0xEE5);
#ifndef _LIB_BUILD
asm("SP4BRGL equ 0EE5h");
#endif
// aliases
extern volatile unsigned char           SPBRG4              __at(0xEE5);
#ifndef _LIB_BUILD
asm("SPBRG4 equ 0EE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP4BRGL                :8;
    };
} SP4BRGLbits_t;
extern volatile SP4BRGLbits_t SP4BRGLbits __at(0xEE5);
// bitfield macros
#define _SP4BRGL_SP4BRGL_POSN                               0x0
#define _SP4BRGL_SP4BRGL_POSITION                           0x0
#define _SP4BRGL_SP4BRGL_SIZE                               0x8
#define _SP4BRGL_SP4BRGL_LENGTH                             0x8
#define _SP4BRGL_SP4BRGL_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP4BRGL                :8;
    };
} SPBRG4bits_t;
extern volatile SPBRG4bits_t SPBRG4bits __at(0xEE5);
// bitfield macros
#define _SPBRG4_SP4BRGL_POSN                                0x0
#define _SPBRG4_SP4BRGL_POSITION                            0x0
#define _SPBRG4_SP4BRGL_SIZE                                0x8
#define _SPBRG4_SP4BRGL_LENGTH                              0x8
#define _SPBRG4_SP4BRGL_MASK                                0xFF

// Register: SP4BRGH
#define SP4BRGH SP4BRGH
extern volatile unsigned char           SP4BRGH             __at(0xEE6);
#ifndef _LIB_BUILD
asm("SP4BRGH equ 0EE6h");
#endif
// aliases
extern volatile unsigned char           SPBRGH4             __at(0xEE6);
#ifndef _LIB_BUILD
asm("SPBRGH4 equ 0EE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP4BRGH                :8;
    };
} SP4BRGHbits_t;
extern volatile SP4BRGHbits_t SP4BRGHbits __at(0xEE6);
// bitfield macros
#define _SP4BRGH_SP4BRGH_POSN                               0x0
#define _SP4BRGH_SP4BRGH_POSITION                           0x0
#define _SP4BRGH_SP4BRGH_SIZE                               0x8
#define _SP4BRGH_SP4BRGH_LENGTH                             0x8
#define _SP4BRGH_SP4BRGH_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP4BRGH                :8;
    };
} SPBRGH4bits_t;
extern volatile SPBRGH4bits_t SPBRGH4bits __at(0xEE6);
// bitfield macros
#define _SPBRGH4_SP4BRGH_POSN                               0x0
#define _SPBRGH4_SP4BRGH_POSITION                           0x0
#define _SPBRGH4_SP4BRGH_SIZE                               0x8
#define _SPBRGH4_SP4BRGH_LENGTH                             0x8
#define _SPBRGH4_SP4BRGH_MASK                               0xFF

// Register: RC4STA
#define RC4STA RC4STA
extern volatile unsigned char           RC4STA              __at(0xEE7);
#ifndef _LIB_BUILD
asm("RC4STA equ 0EE7h");
#endif
// aliases
extern volatile unsigned char           RCSTA4              __at(0xEE7);
#ifndef _LIB_BUILD
asm("RCSTA4 equ 0EE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC4STAbits_t;
extern volatile RC4STAbits_t RC4STAbits __at(0xEE7);
// bitfield macros
#define _RC4STA_RX9D_POSN                                   0x0
#define _RC4STA_RX9D_POSITION                               0x0
#define _RC4STA_RX9D_SIZE                                   0x1
#define _RC4STA_RX9D_LENGTH                                 0x1
#define _RC4STA_RX9D_MASK                                   0x1
#define _RC4STA_OERR_POSN                                   0x1
#define _RC4STA_OERR_POSITION                               0x1
#define _RC4STA_OERR_SIZE                                   0x1
#define _RC4STA_OERR_LENGTH                                 0x1
#define _RC4STA_OERR_MASK                                   0x2
#define _RC4STA_FERR_POSN                                   0x2
#define _RC4STA_FERR_POSITION                               0x2
#define _RC4STA_FERR_SIZE                                   0x1
#define _RC4STA_FERR_LENGTH                                 0x1
#define _RC4STA_FERR_MASK                                   0x4
#define _RC4STA_ADDEN_POSN                                  0x3
#define _RC4STA_ADDEN_POSITION                              0x3
#define _RC4STA_ADDEN_SIZE                                  0x1
#define _RC4STA_ADDEN_LENGTH                                0x1
#define _RC4STA_ADDEN_MASK                                  0x8
#define _RC4STA_CREN_POSN                                   0x4
#define _RC4STA_CREN_POSITION                               0x4
#define _RC4STA_CREN_SIZE                                   0x1
#define _RC4STA_CREN_LENGTH                                 0x1
#define _RC4STA_CREN_MASK                                   0x10
#define _RC4STA_SREN_POSN                                   0x5
#define _RC4STA_SREN_POSITION                               0x5
#define _RC4STA_SREN_SIZE                                   0x1
#define _RC4STA_SREN_LENGTH                                 0x1
#define _RC4STA_SREN_MASK                                   0x20
#define _RC4STA_RX9_POSN                                    0x6
#define _RC4STA_RX9_POSITION                                0x6
#define _RC4STA_RX9_SIZE                                    0x1
#define _RC4STA_RX9_LENGTH                                  0x1
#define _RC4STA_RX9_MASK                                    0x40
#define _RC4STA_SPEN_POSN                                   0x7
#define _RC4STA_SPEN_POSITION                               0x7
#define _RC4STA_SPEN_SIZE                                   0x1
#define _RC4STA_SPEN_LENGTH                                 0x1
#define _RC4STA_SPEN_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RCSTA4bits_t;
extern volatile RCSTA4bits_t RCSTA4bits __at(0xEE7);
// bitfield macros
#define _RCSTA4_RX9D_POSN                                   0x0
#define _RCSTA4_RX9D_POSITION                               0x0
#define _RCSTA4_RX9D_SIZE                                   0x1
#define _RCSTA4_RX9D_LENGTH                                 0x1
#define _RCSTA4_RX9D_MASK                                   0x1
#define _RCSTA4_OERR_POSN                                   0x1
#define _RCSTA4_OERR_POSITION                               0x1
#define _RCSTA4_OERR_SIZE                                   0x1
#define _RCSTA4_OERR_LENGTH                                 0x1
#define _RCSTA4_OERR_MASK                                   0x2
#define _RCSTA4_FERR_POSN                                   0x2
#define _RCSTA4_FERR_POSITION                               0x2
#define _RCSTA4_FERR_SIZE                                   0x1
#define _RCSTA4_FERR_LENGTH                                 0x1
#define _RCSTA4_FERR_MASK                                   0x4
#define _RCSTA4_ADDEN_POSN                                  0x3
#define _RCSTA4_ADDEN_POSITION                              0x3
#define _RCSTA4_ADDEN_SIZE                                  0x1
#define _RCSTA4_ADDEN_LENGTH                                0x1
#define _RCSTA4_ADDEN_MASK                                  0x8
#define _RCSTA4_CREN_POSN                                   0x4
#define _RCSTA4_CREN_POSITION                               0x4
#define _RCSTA4_CREN_SIZE                                   0x1
#define _RCSTA4_CREN_LENGTH                                 0x1
#define _RCSTA4_CREN_MASK                                   0x10
#define _RCSTA4_SREN_POSN                                   0x5
#define _RCSTA4_SREN_POSITION                               0x5
#define _RCSTA4_SREN_SIZE                                   0x1
#define _RCSTA4_SREN_LENGTH                                 0x1
#define _RCSTA4_SREN_MASK                                   0x20
#define _RCSTA4_RX9_POSN                                    0x6
#define _RCSTA4_RX9_POSITION                                0x6
#define _RCSTA4_RX9_SIZE                                    0x1
#define _RCSTA4_RX9_LENGTH                                  0x1
#define _RCSTA4_RX9_MASK                                    0x40
#define _RCSTA4_SPEN_POSN                                   0x7
#define _RCSTA4_SPEN_POSITION                               0x7
#define _RCSTA4_SPEN_SIZE                                   0x1
#define _RCSTA4_SPEN_LENGTH                                 0x1
#define _RCSTA4_SPEN_MASK                                   0x80

// Register: TX4STA
#define TX4STA TX4STA
extern volatile unsigned char           TX4STA              __at(0xEE8);
#ifndef _LIB_BUILD
asm("TX4STA equ 0EE8h");
#endif
// aliases
extern volatile unsigned char           TXSTA4              __at(0xEE8);
#ifndef _LIB_BUILD
asm("TXSTA4 equ 0EE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TX4STAbits_t;
extern volatile TX4STAbits_t TX4STAbits __at(0xEE8);
// bitfield macros
#define _TX4STA_TX9D_POSN                                   0x0
#define _TX4STA_TX9D_POSITION                               0x0
#define _TX4STA_TX9D_SIZE                                   0x1
#define _TX4STA_TX9D_LENGTH                                 0x1
#define _TX4STA_TX9D_MASK                                   0x1
#define _TX4STA_TRMT_POSN                                   0x1
#define _TX4STA_TRMT_POSITION                               0x1
#define _TX4STA_TRMT_SIZE                                   0x1
#define _TX4STA_TRMT_LENGTH                                 0x1
#define _TX4STA_TRMT_MASK                                   0x2
#define _TX4STA_BRGH_POSN                                   0x2
#define _TX4STA_BRGH_POSITION                               0x2
#define _TX4STA_BRGH_SIZE                                   0x1
#define _TX4STA_BRGH_LENGTH                                 0x1
#define _TX4STA_BRGH_MASK                                   0x4
#define _TX4STA_SENDB_POSN                                  0x3
#define _TX4STA_SENDB_POSITION                              0x3
#define _TX4STA_SENDB_SIZE                                  0x1
#define _TX4STA_SENDB_LENGTH                                0x1
#define _TX4STA_SENDB_MASK                                  0x8
#define _TX4STA_SYNC_POSN                                   0x4
#define _TX4STA_SYNC_POSITION                               0x4
#define _TX4STA_SYNC_SIZE                                   0x1
#define _TX4STA_SYNC_LENGTH                                 0x1
#define _TX4STA_SYNC_MASK                                   0x10
#define _TX4STA_TXEN_POSN                                   0x5
#define _TX4STA_TXEN_POSITION                               0x5
#define _TX4STA_TXEN_SIZE                                   0x1
#define _TX4STA_TXEN_LENGTH                                 0x1
#define _TX4STA_TXEN_MASK                                   0x20
#define _TX4STA_TX9_POSN                                    0x6
#define _TX4STA_TX9_POSITION                                0x6
#define _TX4STA_TX9_SIZE                                    0x1
#define _TX4STA_TX9_LENGTH                                  0x1
#define _TX4STA_TX9_MASK                                    0x40
#define _TX4STA_CSRC_POSN                                   0x7
#define _TX4STA_CSRC_POSITION                               0x7
#define _TX4STA_CSRC_SIZE                                   0x1
#define _TX4STA_CSRC_LENGTH                                 0x1
#define _TX4STA_CSRC_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX9D                   :1;
        unsigned TRMT                   :1;
        unsigned BRGH                   :1;
        unsigned SENDB                  :1;
        unsigned SYNC                   :1;
        unsigned TXEN                   :1;
        unsigned TX9                    :1;
        unsigned CSRC                   :1;
    };
} TXSTA4bits_t;
