MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile BAUDCTL4bits_t BAUDCTL4bits __at(0xEE9);
// bitfield macros
#define _BAUDCTL4_ABDEN_POSN                                0x0
#define _BAUDCTL4_ABDEN_POSITION                            0x0
#define _BAUDCTL4_ABDEN_SIZE                                0x1
#define _BAUDCTL4_ABDEN_LENGTH                              0x1
#define _BAUDCTL4_ABDEN_MASK                                0x1
#define _BAUDCTL4_WUE_POSN                                  0x1
#define _BAUDCTL4_WUE_POSITION                              0x1
#define _BAUDCTL4_WUE_SIZE                                  0x1
#define _BAUDCTL4_WUE_LENGTH                                0x1
#define _BAUDCTL4_WUE_MASK                                  0x2
#define _BAUDCTL4_BRG16_POSN                                0x3
#define _BAUDCTL4_BRG16_POSITION                            0x3
#define _BAUDCTL4_BRG16_SIZE                                0x1
#define _BAUDCTL4_BRG16_LENGTH                              0x1
#define _BAUDCTL4_BRG16_MASK                                0x8
#define _BAUDCTL4_SCKP_POSN                                 0x4
#define _BAUDCTL4_SCKP_POSITION                             0x4
#define _BAUDCTL4_SCKP_SIZE                                 0x1
#define _BAUDCTL4_SCKP_LENGTH                               0x1
#define _BAUDCTL4_SCKP_MASK                                 0x10
#define _BAUDCTL4_RCIDL_POSN                                0x6
#define _BAUDCTL4_RCIDL_POSITION                            0x6
#define _BAUDCTL4_RCIDL_SIZE                                0x1
#define _BAUDCTL4_RCIDL_LENGTH                              0x1
#define _BAUDCTL4_RCIDL_MASK                                0x40
#define _BAUDCTL4_ABDOVF_POSN                               0x7
#define _BAUDCTL4_ABDOVF_POSITION                           0x7
#define _BAUDCTL4_ABDOVF_SIZE                               0x1
#define _BAUDCTL4_ABDOVF_LENGTH                             0x1
#define _BAUDCTL4_ABDOVF_MASK                               0x80

// Register: RC3REG
#define RC3REG RC3REG
extern volatile unsigned char           RC3REG              __at(0xEEA);
#ifndef _LIB_BUILD
asm("RC3REG equ 0EEAh");
#endif
// aliases
extern volatile unsigned char           RCREG3              __at(0xEEA);
#ifndef _LIB_BUILD
asm("RCREG3 equ 0EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC3REG                 :8;
    };
} RC3REGbits_t;
extern volatile RC3REGbits_t RC3REGbits __at(0xEEA);
// bitfield macros
#define _RC3REG_RC3REG_POSN                                 0x0
#define _RC3REG_RC3REG_POSITION                             0x0
#define _RC3REG_RC3REG_SIZE                                 0x8
#define _RC3REG_RC3REG_LENGTH                               0x8
#define _RC3REG_RC3REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RC3REG                 :8;
    };
} RCREG3bits_t;
extern volatile RCREG3bits_t RCREG3bits __at(0xEEA);
// bitfield macros
#define _RCREG3_RC3REG_POSN                                 0x0
#define _RCREG3_RC3REG_POSITION                             0x0
#define _RCREG3_RC3REG_SIZE                                 0x8
#define _RCREG3_RC3REG_LENGTH                               0x8
#define _RCREG3_RC3REG_MASK                                 0xFF

// Register: TX3REG
#define TX3REG TX3REG
extern volatile unsigned char           TX3REG              __at(0xEEB);
#ifndef _LIB_BUILD
asm("TX3REG equ 0EEBh");
#endif
// aliases
extern volatile unsigned char           TXREG3              __at(0xEEB);
#ifndef _LIB_BUILD
asm("TXREG3 equ 0EEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TX3REG                 :8;
    };
} TX3REGbits_t;
extern volatile TX3REGbits_t TX3REGbits __at(0xEEB);
// bitfield macros
#define _TX3REG_TX3REG_POSN                                 0x0
#define _TX3REG_TX3REG_POSITION                             0x0
#define _TX3REG_TX3REG_SIZE                                 0x8
#define _TX3REG_TX3REG_LENGTH                               0x8
#define _TX3REG_TX3REG_MASK                                 0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TX3REG                 :8;
    };
} TXREG3bits_t;
extern volatile TXREG3bits_t TXREG3bits __at(0xEEB);
// bitfield macros
#define _TXREG3_TX3REG_POSN                                 0x0
#define _TXREG3_TX3REG_POSITION                             0x0
#define _TXREG3_TX3REG_SIZE                                 0x8
#define _TXREG3_TX3REG_LENGTH                               0x8
#define _TXREG3_TX3REG_MASK                                 0xFF

// Register: SP3BRG
#define SP3BRG SP3BRG
extern volatile unsigned short          SP3BRG              __at(0xEEC);
#ifndef _LIB_BUILD
asm("SP3BRG equ 0EECh");
#endif

// Register: SP3BRGL
#define SP3BRGL SP3BRGL
extern volatile unsigned char           SP3BRGL             __at(0xEEC);
#ifndef _LIB_BUILD
asm("SP3BRGL equ 0EECh");
#endif
// aliases
extern volatile unsigned char           SPBRG3              __at(0xEEC);
#ifndef _LIB_BUILD
asm("SPBRG3 equ 0EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP3BRGL                :8;
    };
} SP3BRGLbits_t;
extern volatile SP3BRGLbits_t SP3BRGLbits __at(0xEEC);
// bitfield macros
#define _SP3BRGL_SP3BRGL_POSN                               0x0
#define _SP3BRGL_SP3BRGL_POSITION                           0x0
#define _SP3BRGL_SP3BRGL_SIZE                               0x8
#define _SP3BRGL_SP3BRGL_LENGTH                             0x8
#define _SP3BRGL_SP3BRGL_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP3BRGL                :8;
    };
} SPBRG3bits_t;
extern volatile SPBRG3bits_t SPBRG3bits __at(0xEEC);
// bitfield macros
#define _SPBRG3_SP3BRGL_POSN                                0x0
#define _SPBRG3_SP3BRGL_POSITION                            0x0
#define _SPBRG3_SP3BRGL_SIZE                                0x8
#define _SPBRG3_SP3BRGL_LENGTH                              0x8
#define _SPBRG3_SP3BRGL_MASK                                0xFF

// Register: SP3BRGH
#define SP3BRGH SP3BRGH
extern volatile unsigned char           SP3BRGH             __at(0xEED);
#ifndef _LIB_BUILD
asm("SP3BRGH equ 0EEDh");
#endif
// aliases
extern volatile unsigned char           SPBRGH3             __at(0xEED);
#ifndef _LIB_BUILD
asm("SPBRGH3 equ 0EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SP3BRGH                :8;
    };
} SP3BRGHbits_t;
extern volatile SP3BRGHbits_t SP3BRGHbits __at(0xEED);
// bitfield macros
#define _SP3BRGH_SP3BRGH_POSN                               0x0
#define _SP3BRGH_SP3BRGH_POSITION                           0x0
#define _SP3BRGH_SP3BRGH_SIZE                               0x8
#define _SP3BRGH_SP3BRGH_LENGTH                             0x8
#define _SP3BRGH_SP3BRGH_MASK                               0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned SP3BRGH                :8;
    };
} SPBRGH3bits_t;
extern volatile SPBRGH3bits_t SPBRGH3bits __at(0xEED);
// bitfield macros
#define _SPBRGH3_SP3BRGH_POSN                               0x0
#define _SPBRGH3_SP3BRGH_POSITION                           0x0
#define _SPBRGH3_SP3BRGH_SIZE                               0x8
#define _SPBRGH3_SP3BRGH_LENGTH                             0x8
#define _SPBRGH3_SP3BRGH_MASK                               0xFF

// Register: RC3STA
#define RC3STA RC3STA
extern volatile unsigned char           RC3STA              __at(0xEEE);
#ifndef _LIB_BUILD
asm("RC3STA equ 0EEEh");
#endif
// aliases
extern volatile unsigned char           RCSTA3              __at(0xEEE);
#ifndef _LIB_BUILD
asm("RCSTA3 equ 0EEEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RC3STAbits_t;
extern volatile RC3STAbits_t RC3STAbits __at(0xEEE);
// bitfield macros
#define _RC3STA_RX9D_POSN                                   0x0
#define _RC3STA_RX9D_POSITION                               0x0
#define _RC3STA_RX9D_SIZE                                   0x1
#define _RC3STA_RX9D_LENGTH                                 0x1
#define _RC3STA_RX9D_MASK                                   0x1
#define _RC3STA_OERR_POSN                                   0x1
#define _RC3STA_OERR_POSITION                               0x1
#define _RC3STA_OERR_SIZE                                   0x1
#define _RC3STA_OERR_LENGTH                                 0x1
#define _RC3STA_OERR_MASK                                   0x2
#define _RC3STA_FERR_POSN                                   0x2
#define _RC3STA_FERR_POSITION                               0x2
#define _RC3STA_FERR_SIZE                                   0x1
#define _RC3STA_FERR_LENGTH                                 0x1
#define _RC3STA_FERR_MASK                                   0x4
#define _RC3STA_ADDEN_POSN                                  0x3
#define _RC3STA_ADDEN_POSITION                              0x3
#define _RC3STA_ADDEN_SIZE                                  0x1
#define _RC3STA_ADDEN_LENGTH                                0x1
#define _RC3STA_ADDEN_MASK                                  0x8
#define _RC3STA_CREN_POSN                                   0x4
#define _RC3STA_CREN_POSITION                               0x4
#define _RC3STA_CREN_SIZE                                   0x1
#define _RC3STA_CREN_LENGTH                                 0x1
#define _RC3STA_CREN_MASK                                   0x10
#define _RC3STA_SREN_POSN                                   0x5
#define _RC3STA_SREN_POSITION                               0x5
#define _RC3STA_SREN_SIZE                                   0x1
#define _RC3STA_SREN_LENGTH                                 0x1
#define _RC3STA_SREN_MASK                                   0x20
#define _RC3STA_RX9_POSN                                    0x6
#define _RC3STA_RX9_POSITION                                0x6
#define _RC3STA_RX9_SIZE                                    0x1
#define _RC3STA_RX9_LENGTH                                  0x1
#define _RC3STA_RX9_MASK                                    0x40
#define _RC3STA_SPEN_POSN                                   0x7
#define _RC3STA_SPEN_POSITION                               0x7
#define _RC3STA_SPEN_SIZE                                   0x1
#define _RC3STA_SPEN_LENGTH                                 0x1
#define _RC3STA_SPEN_MASK                                   0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
} RCSTA3bits_t;
