MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
extern volatile __bit                   TMR3H7              __at(0x7E47);	// @ (0xFC8 * 8 + 7)
#define                                 TMR3H7_bit          _BIT_ACCESS(TMR3H,7)
// PIE5<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x7172);	// @ (0xE2E * 8 + 2)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x71C2);	// @ (0xE38 * 8 + 2)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR5,2)
// IPR5<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x7122);	// @ (0xE24 * 8 + 2)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR5,2)
// TMR3L<TMR3L0>
extern volatile __bit                   TMR3L0              __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 TMR3L0_bit          _BIT_ACCESS(TMR3L,0)
// TMR3L<TMR3L1>
extern volatile __bit                   TMR3L1              __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 TMR3L1_bit          _BIT_ACCESS(TMR3L,1)
// TMR3L<TMR3L2>
extern volatile __bit                   TMR3L2              __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 TMR3L2_bit          _BIT_ACCESS(TMR3L,2)
// TMR3L<TMR3L3>
extern volatile __bit                   TMR3L3              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 TMR3L3_bit          _BIT_ACCESS(TMR3L,3)
// TMR3L<TMR3L4>
extern volatile __bit                   TMR3L4              __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 TMR3L4_bit          _BIT_ACCESS(TMR3L,4)
// TMR3L<TMR3L5>
extern volatile __bit                   TMR3L5              __at(0x7E3D);	// @ (0xFC7 * 8 + 5)
#define                                 TMR3L5_bit          _BIT_ACCESS(TMR3L,5)
// TMR3L<TMR3L6>
extern volatile __bit                   TMR3L6              __at(0x7E3E);	// @ (0xFC7 * 8 + 6)
#define                                 TMR3L6_bit          _BIT_ACCESS(TMR3L,6)
// TMR3L<TMR3L7>
extern volatile __bit                   TMR3L7              __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 TMR3L7_bit          _BIT_ACCESS(TMR3L,7)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x726B);	// @ (0xE4D * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x7E48);	// @ (0xFC9 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE5<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x7173);	// @ (0xE2E * 8 + 3)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE5,3)
// PIR5<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x71C3);	// @ (0xE38 * 8 + 3)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR5,3)
// IPR5<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x7123);	// @ (0xE24 * 8 + 3)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR5,3)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x726C);	// @ (0xE4D * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,7)
// TMR5L<TMR50>
extern volatile __bit                   TMR50               __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 TMR50_bit           _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR51>
extern volatile __bit                   TMR51               __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 TMR51_bit           _BIT_ACCESS(TMR5L,1)
// TMR5H<TMR510>
extern volatile __bit                   TMR510              __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 TMR510_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR511>
extern volatile __bit                   TMR511              __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 TMR511_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR512>
extern volatile __bit                   TMR512              __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 TMR512_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR513>
extern volatile __bit                   TMR513              __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 TMR513_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR514>
extern volatile __bit                   TMR514              __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 TMR514_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR515>
extern volatile __bit                   TMR515              __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 TMR515_bit          _BIT_ACCESS(TMR5H,7)
// TMR5L<TMR52>
extern volatile __bit                   TMR52               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 TMR52_bit           _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR53>
extern volatile __bit                   TMR53               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 TMR53_bit           _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR54>
extern volatile __bit                   TMR54               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 TMR54_bit           _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR55>
extern volatile __bit                   TMR55               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 TMR55_bit           _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR56>
extern volatile __bit                   TMR56               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TMR56_bit           _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR57>
extern volatile __bit                   TMR57               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 TMR57_bit           _BIT_ACCESS(TMR5L,7)
// TMR5H<TMR58>
extern volatile __bit                   TMR58               __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 TMR58_bit           _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR59>
extern volatile __bit                   TMR59               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 TMR59_bit           _BIT_ACCESS(TMR5H,1)
// PIE6<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x717A);	// @ (0xE2F * 8 + 2)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE6,2)
// PIR6<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x71CA);	// @ (0xE39 * 8 + 2)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR6,2)
// IPR6<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x712A);	// @ (0xE25 * 8 + 2)
#define                                 TMR5GIP_bit         _BIT_ACCESS(IPR6,2)
// TMR5H<TMR5H0>
extern volatile __bit                   TMR5H0              __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 TMR5H0_bit          _BIT_ACCESS(TMR5H,0)
// TMR5H<TMR5H1>
extern volatile __bit                   TMR5H1              __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 TMR5H1_bit          _BIT_ACCESS(TMR5H,1)
// TMR5H<TMR5H2>
extern volatile __bit                   TMR5H2              __at(0x7E12);	// @ (0xFC2 * 8 + 2)
#define                                 TMR5H2_bit          _BIT_ACCESS(TMR5H,2)
// TMR5H<TMR5H3>
extern volatile __bit                   TMR5H3              __at(0x7E13);	// @ (0xFC2 * 8 + 3)
#define                                 TMR5H3_bit          _BIT_ACCESS(TMR5H,3)
// TMR5H<TMR5H4>
extern volatile __bit                   TMR5H4              __at(0x7E14);	// @ (0xFC2 * 8 + 4)
#define                                 TMR5H4_bit          _BIT_ACCESS(TMR5H,4)
// TMR5H<TMR5H5>
extern volatile __bit                   TMR5H5              __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 TMR5H5_bit          _BIT_ACCESS(TMR5H,5)
// TMR5H<TMR5H6>
extern volatile __bit                   TMR5H6              __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 TMR5H6_bit          _BIT_ACCESS(TMR5H,6)
// TMR5H<TMR5H7>
extern volatile __bit                   TMR5H7              __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 TMR5H7_bit          _BIT_ACCESS(TMR5H,7)
// PIE5<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x7174);	// @ (0xE2E * 8 + 4)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x71C4);	// @ (0xE38 * 8 + 4)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x7124);	// @ (0xE24 * 8 + 4)
#define                                 TMR5IP_bit          _BIT_ACCESS(IPR5,4)
// TMR5L<TMR5L0>
extern volatile __bit                   TMR5L0              __at(0x7E08);	// @ (0xFC1 * 8 + 0)
#define                                 TMR5L0_bit          _BIT_ACCESS(TMR5L,0)
// TMR5L<TMR5L1>
extern volatile __bit                   TMR5L1              __at(0x7E09);	// @ (0xFC1 * 8 + 1)
#define                                 TMR5L1_bit          _BIT_ACCESS(TMR5L,1)
// TMR5L<TMR5L2>
extern volatile __bit                   TMR5L2              __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 TMR5L2_bit          _BIT_ACCESS(TMR5L,2)
// TMR5L<TMR5L3>
extern volatile __bit                   TMR5L3              __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 TMR5L3_bit          _BIT_ACCESS(TMR5L,3)
// TMR5L<TMR5L4>
extern volatile __bit                   TMR5L4              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 TMR5L4_bit          _BIT_ACCESS(TMR5L,4)
// TMR5L<TMR5L5>
extern volatile __bit                   TMR5L5              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 TMR5L5_bit          _BIT_ACCESS(TMR5L,5)
// TMR5L<TMR5L6>
extern volatile __bit                   TMR5L6              __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 TMR5L6_bit          _BIT_ACCESS(TMR5L,6)
// TMR5L<TMR5L7>
extern volatile __bit                   TMR5L7              __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 TMR5L7_bit          _BIT_ACCESS(TMR5L,7)
// PMD1<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x726D);	// @ (0xE4D * 8 + 5)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD1,5)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x7E18);	// @ (0xFC3 * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE5<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x7175);	// @ (0xE2E * 8 + 5)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x71C5);	// @ (0xE38 * 8 + 5)
#define                                 TMR6IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<TMR6IP>
extern volatile __bit                   TMR6IP              __at(0x7125);	// @ (0xE24 * 8 + 5)
#define                                 TMR6IP_bit          _BIT_ACCESS(IPR5,5)
// PMD1<TMR6MD>
extern volatile __bit                   TMR6MD              __at(0x726E);	// @ (0xE4D * 8 + 6)
#define                                 TMR6MD_bit          _BIT_ACCESS(PMD1,6)
// T6CON<TMR6ON>
extern volatile __bit                   TMR6ON              __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 TMR6ON_bit          _BIT_ACCESS(T6CON,7)
// TMR7L<TMR70>
extern volatile __bit                   TMR70               __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 TMR70_bit           _BIT_ACCESS(TMR7L,0)
// TMR7L<TMR71>
extern volatile __bit                   TMR71               __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 TMR71_bit           _BIT_ACCESS(TMR7L,1)
// TMR7H<TMR710>
extern volatile __bit                   TMR710              __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 TMR710_bit          _BIT_ACCESS(TMR7H,2)
// TMR7H<TMR711>
extern volatile __bit                   TMR711              __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 TMR711_bit          _BIT_ACCESS(TMR7H,3)
// TMR7H<TMR712>
extern volatile __bit                   TMR712              __at(0x797C);	// @ (0xF2F * 8 + 4)
#define                                 TMR712_bit          _BIT_ACCESS(TMR7H,4)
// TMR7H<TMR713>
extern volatile __bit                   TMR713              __at(0x797D);	// @ (0xF2F * 8 + 5)
#define                                 TMR713_bit          _BIT_ACCESS(TMR7H,5)
// TMR7H<TMR714>
extern volatile __bit                   TMR714              __at(0x797E);	// @ (0xF2F * 8 + 6)
#define                                 TMR714_bit          _BIT_ACCESS(TMR7H,6)
// TMR7H<TMR715>
extern volatile __bit                   TMR715              __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 TMR715_bit          _BIT_ACCESS(TMR7H,7)
// TMR7L<TMR72>
extern volatile __bit                   TMR72               __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 TMR72_bit           _BIT_ACCESS(TMR7L,2)
// TMR7L<TMR73>
extern volatile __bit                   TMR73               __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 TMR73_bit           _BIT_ACCESS(TMR7L,3)
// TMR7L<TMR74>
extern volatile __bit                   TMR74               __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 TMR74_bit           _BIT_ACCESS(TMR7L,4)
// TMR7L<TMR75>
extern volatile __bit                   TMR75               __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 TMR75_bit           _BIT_ACCESS(TMR7L,5)
// TMR7L<TMR76>
extern volatile __bit                   TMR76               __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 TMR76_bit           _BIT_ACCESS(TMR7L,6)
// TMR7L<TMR77>
extern volatile __bit                   TMR77               __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 TMR77_bit           _BIT_ACCESS(TMR7L,7)
// TMR7H<TMR78>
extern volatile __bit                   TMR78               __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 TMR78_bit           _BIT_ACCESS(TMR7H,0)
// TMR7H<TMR79>
extern volatile __bit                   TMR79               __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 TMR79_bit           _BIT_ACCESS(TMR7H,1)
// PIE6<TMR7GIE>
extern volatile __bit                   TMR7GIE             __at(0x717B);	// @ (0xE2F * 8 + 3)
#define                                 TMR7GIE_bit         _BIT_ACCESS(PIE6,3)
// PIR6<TMR7GIF>
extern volatile __bit                   TMR7GIF             __at(0x71CB);	// @ (0xE39 * 8 + 3)
#define                                 TMR7GIF_bit         _BIT_ACCESS(PIR6,3)
// IPR6<TMR7GIP>
extern volatile __bit                   TMR7GIP             __at(0x712B);	// @ (0xE25 * 8 + 3)
#define                                 TMR7GIP_bit         _BIT_ACCESS(IPR6,3)
// TMR7H<TMR7H0>
extern volatile __bit                   TMR7H0              __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 TMR7H0_bit          _BIT_ACCESS(TMR7H,0)
// TMR7H<TMR7H1>
extern volatile __bit                   TMR7H1              __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 TMR7H1_bit          _BIT_ACCESS(TMR7H,1)
// TMR7H<TMR7H2>
extern volatile __bit                   TMR7H2              __at(0x797A);	// @ (0xF2F * 8 + 2)
#define                                 TMR7H2_bit          _BIT_ACCESS(TMR7H,2)
// TMR7H<TMR7H3>
extern volatile __bit                   TMR7H3              __at(0x797B);	// @ (0xF2F * 8 + 3)
#define                                 TMR7H3_bit          _BIT_ACCESS(TMR7H,3)
// TMR7H<TMR7H4>
extern volatile __bit                   TMR7H4              __at(0x797C);	// @ (0xF2F * 8 + 4)
#define                                 TMR7H4_bit          _BIT_ACCESS(TMR7H,4)
// TMR7H<TMR7H5>
extern volatile __bit                   TMR7H5              __at(0x797D);	// @ (0xF2F * 8 + 5)
#define                                 TMR7H5_bit          _BIT_ACCESS(TMR7H,5)
// TMR7H<TMR7H6>
extern volatile __bit                   TMR7H6              __at(0x797E);	// @ (0xF2F * 8 + 6)
#define                                 TMR7H6_bit          _BIT_ACCESS(TMR7H,6)
// TMR7H<TMR7H7>
extern volatile __bit                   TMR7H7              __at(0x797F);	// @ (0xF2F * 8 + 7)
#define                                 TMR7H7_bit          _BIT_ACCESS(TMR7H,7)
// PIE5<TMR7IE>
extern volatile __bit                   TMR7IE              __at(0x7176);	// @ (0xE2E * 8 + 6)
#define                                 TMR7IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<TMR7IF>
extern volatile __bit                   TMR7IF              __at(0x71C6);	// @ (0xE38 * 8 + 6)
#define                                 TMR7IF_bit          _BIT_ACCESS(PIR5,6)
// IPR5<TMR7IP>
extern volatile __bit                   TMR7IP              __at(0x7126);	// @ (0xE24 * 8 + 6)
#define                                 TMR7IP_bit          _BIT_ACCESS(IPR5,6)
// TMR7L<TMR7L0>
extern volatile __bit                   TMR7L0              __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 TMR7L0_bit          _BIT_ACCESS(TMR7L,0)
// TMR7L<TMR7L1>
extern volatile __bit                   TMR7L1              __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 TMR7L1_bit          _BIT_ACCESS(TMR7L,1)
// TMR7L<TMR7L2>
extern volatile __bit                   TMR7L2              __at(0x7972);	// @ (0xF2E * 8 + 2)
#define                                 TMR7L2_bit          _BIT_ACCESS(TMR7L,2)
// TMR7L<TMR7L3>
extern volatile __bit                   TMR7L3              __at(0x7973);	// @ (0xF2E * 8 + 3)
#define                                 TMR7L3_bit          _BIT_ACCESS(TMR7L,3)
// TMR7L<TMR7L4>
extern volatile __bit                   TMR7L4              __at(0x7974);	// @ (0xF2E * 8 + 4)
#define                                 TMR7L4_bit          _BIT_ACCESS(TMR7L,4)
// TMR7L<TMR7L5>
extern volatile __bit                   TMR7L5              __at(0x7975);	// @ (0xF2E * 8 + 5)
#define                                 TMR7L5_bit          _BIT_ACCESS(TMR7L,5)
// TMR7L<TMR7L6>
extern volatile __bit                   TMR7L6              __at(0x7976);	// @ (0xF2E * 8 + 6)
#define                                 TMR7L6_bit          _BIT_ACCESS(TMR7L,6)
// TMR7L<TMR7L7>
extern volatile __bit                   TMR7L7              __at(0x7977);	// @ (0xF2E * 8 + 7)
#define                                 TMR7L7_bit          _BIT_ACCESS(TMR7L,7)
// PMD1<TMR7MD>
extern volatile __bit                   TMR7MD              __at(0x726F);	// @ (0xE4D * 8 + 7)
#define                                 TMR7MD_bit          _BIT_ACCESS(PMD1,7)
// T7CON<TMR7ON>
extern volatile __bit                   TMR7ON              __at(0x7980);	// @ (0xF30 * 8 + 0)
#define                                 TMR7ON_bit          _BIT_ACCESS(T7CON,0)
// PIE5<TMR8IE>
extern volatile __bit                   TMR8IE              __at(0x7177);	// @ (0xE2E * 8 + 7)
#define                                 TMR8IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<TMR8IF>
extern volatile __bit                   TMR8IF              __at(0x71C7);	// @ (0xE38 * 8 + 7)
#define                                 TMR8IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<TMR8IP>
extern volatile __bit                   TMR8IP              __at(0x7127);	// @ (0xE24 * 8 + 7)
#define                                 TMR8IP_bit          _BIT_ACCESS(IPR5,7)
// PMD2<TMR8MD>
extern volatile __bit                   TMR8MD              __at(0x7270);	// @ (0xE4E * 8 + 0)
#define                                 TMR8MD_bit          _BIT_ACCESS(PMD2,0)
// T8CON<TMR8ON>
extern volatile __bit                   TMR8ON              __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 TMR8ON_bit          _BIT_ACCESS(T8CON,7)
// STATUS<TO>
extern volatile __bit                   TO                  __at(0x7EC6);	// @ (0xFD8 * 8 + 6)
#define                                 TO_bit              _BIT_ACCESS(STATUS,6)
// TRISA<TRISA0>
extern volatile __bit                   TRISA0              __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 TRISA0_bit          _BIT_ACCESS(TRISA,0)
// TRISA<TRISA1>
extern volatile __bit                   TRISA1              __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 TRISA1_bit          _BIT_ACCESS(TRISA,1)
// TRISA<TRISA2>
extern volatile __bit                   TRISA2              __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 TRISA2_bit          _BIT_ACCESS(TRISA,2)
// TRISA<TRISA3>
extern volatile __bit                   TRISA3              __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 TRISA3_bit          _BIT_ACCESS(TRISA,3)
// TRISA<TRISA4>
extern volatile __bit                   TRISA4              __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 TRISA4_bit          _BIT_ACCESS(TRISA,4)
// TRISA<TRISA5>
extern volatile __bit                   TRISA5              __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 TRISA5_bit          _BIT_ACCESS(TRISA,5)
// TRISA<TRISA6>
extern volatile __bit                   TRISA6              __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 TRISA6_bit          _BIT_ACCESS(TRISA,6)
// TRISA<TRISA7>
extern volatile __bit                   TRISA7              __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 TRISA7_bit          _BIT_ACCESS(TRISA,7)
// TRISB<TRISB0>
extern volatile __bit                   TRISB0              __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 TRISB0_bit          _BIT_ACCESS(TRISB,0)
// TRISB<TRISB1>
extern volatile __bit                   TRISB1              __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 TRISB1_bit          _BIT_ACCESS(TRISB,1)
// TRISB<TRISB2>
extern volatile __bit                   TRISB2              __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 TRISB2_bit          _BIT_ACCESS(TRISB,2)
// TRISB<TRISB3>
extern volatile __bit                   TRISB3              __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 TRISB3_bit          _BIT_ACCESS(TRISB,3)
// TRISB<TRISB4>
extern volatile __bit                   TRISB4              __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 TRISB4_bit          _BIT_ACCESS(TRISB,4)
// TRISB<TRISB5>
extern volatile __bit                   TRISB5              __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 TRISB5_bit          _BIT_ACCESS(TRISB,5)
// TRISB<TRISB6>
extern volatile __bit                   TRISB6              __at(0x7C16);	// @ (0xF82 * 8 + 6)
