MikroElektronika/core_packages/PIC/XC8/def/PIC18F67K40/mcu.h
#define                                 TRISB6_bit          _BIT_ACCESS(TRISB,6)
// TRISB<TRISB7>
extern volatile __bit                   TRISB7              __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 TRISB7_bit          _BIT_ACCESS(TRISB,7)
// TRISC<TRISC0>
extern volatile __bit                   TRISC0              __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 TRISC0_bit          _BIT_ACCESS(TRISC,0)
// TRISC<TRISC1>
extern volatile __bit                   TRISC1              __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 TRISC1_bit          _BIT_ACCESS(TRISC,1)
// TRISC<TRISC2>
extern volatile __bit                   TRISC2              __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 TRISC2_bit          _BIT_ACCESS(TRISC,2)
// TRISC<TRISC3>
extern volatile __bit                   TRISC3              __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 TRISC3_bit          _BIT_ACCESS(TRISC,3)
// TRISC<TRISC4>
extern volatile __bit                   TRISC4              __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 TRISC4_bit          _BIT_ACCESS(TRISC,4)
// TRISC<TRISC5>
extern volatile __bit                   TRISC5              __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 TRISC5_bit          _BIT_ACCESS(TRISC,5)
// TRISC<TRISC6>
extern volatile __bit                   TRISC6              __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 TRISC6_bit          _BIT_ACCESS(TRISC,6)
// TRISC<TRISC7>
extern volatile __bit                   TRISC7              __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 TRISC7_bit          _BIT_ACCESS(TRISC,7)
// TRISD<TRISD0>
extern volatile __bit                   TRISD0              __at(0x7C20);	// @ (0xF84 * 8 + 0)
#define                                 TRISD0_bit          _BIT_ACCESS(TRISD,0)
// TRISD<TRISD1>
extern volatile __bit                   TRISD1              __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 TRISD1_bit          _BIT_ACCESS(TRISD,1)
// TRISD<TRISD2>
extern volatile __bit                   TRISD2              __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 TRISD2_bit          _BIT_ACCESS(TRISD,2)
// TRISD<TRISD3>
extern volatile __bit                   TRISD3              __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 TRISD3_bit          _BIT_ACCESS(TRISD,3)
// TRISD<TRISD4>
extern volatile __bit                   TRISD4              __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 TRISD4_bit          _BIT_ACCESS(TRISD,4)
// TRISD<TRISD5>
extern volatile __bit                   TRISD5              __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 TRISD5_bit          _BIT_ACCESS(TRISD,5)
// TRISD<TRISD6>
extern volatile __bit                   TRISD6              __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 TRISD6_bit          _BIT_ACCESS(TRISD,6)
// TRISD<TRISD7>
extern volatile __bit                   TRISD7              __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 TRISD7_bit          _BIT_ACCESS(TRISD,7)
// TRISE<TRISE0>
extern volatile __bit                   TRISE0              __at(0x7C28);	// @ (0xF85 * 8 + 0)
#define                                 TRISE0_bit          _BIT_ACCESS(TRISE,0)
// TRISE<TRISE1>
extern volatile __bit                   TRISE1              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 TRISE1_bit          _BIT_ACCESS(TRISE,1)
// TRISE<TRISE2>
extern volatile __bit                   TRISE2              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 TRISE2_bit          _BIT_ACCESS(TRISE,2)
// TRISE<TRISE3>
extern volatile __bit                   TRISE3              __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 TRISE3_bit          _BIT_ACCESS(TRISE,3)
// TRISE<TRISE4>
extern volatile __bit                   TRISE4              __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 TRISE4_bit          _BIT_ACCESS(TRISE,4)
// TRISE<TRISE5>
extern volatile __bit                   TRISE5              __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 TRISE5_bit          _BIT_ACCESS(TRISE,5)
// TRISE<TRISE6>
extern volatile __bit                   TRISE6              __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 TRISE6_bit          _BIT_ACCESS(TRISE,6)
// TRISE<TRISE7>
extern volatile __bit                   TRISE7              __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 TRISE7_bit          _BIT_ACCESS(TRISE,7)
// TRISF<TRISF0>
extern volatile __bit                   TRISF0              __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 TRISF0_bit          _BIT_ACCESS(TRISF,0)
// TRISF<TRISF1>
extern volatile __bit                   TRISF1              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 TRISF1_bit          _BIT_ACCESS(TRISF,1)
// TRISF<TRISF2>
extern volatile __bit                   TRISF2              __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 TRISF2_bit          _BIT_ACCESS(TRISF,2)
// TRISF<TRISF3>
extern volatile __bit                   TRISF3              __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 TRISF3_bit          _BIT_ACCESS(TRISF,3)
// TRISF<TRISF4>
extern volatile __bit                   TRISF4              __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 TRISF4_bit          _BIT_ACCESS(TRISF,4)
// TRISF<TRISF5>
extern volatile __bit                   TRISF5              __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 TRISF5_bit          _BIT_ACCESS(TRISF,5)
// TRISF<TRISF6>
extern volatile __bit                   TRISF6              __at(0x7C36);	// @ (0xF86 * 8 + 6)
#define                                 TRISF6_bit          _BIT_ACCESS(TRISF,6)
// TRISF<TRISF7>
extern volatile __bit                   TRISF7              __at(0x7C37);	// @ (0xF86 * 8 + 7)
#define                                 TRISF7_bit          _BIT_ACCESS(TRISF,7)
// TRISG<TRISG0>
extern volatile __bit                   TRISG0              __at(0x7C38);	// @ (0xF87 * 8 + 0)
#define                                 TRISG0_bit          _BIT_ACCESS(TRISG,0)
// TRISG<TRISG1>
extern volatile __bit                   TRISG1              __at(0x7C39);	// @ (0xF87 * 8 + 1)
#define                                 TRISG1_bit          _BIT_ACCESS(TRISG,1)
// TRISG<TRISG2>
extern volatile __bit                   TRISG2              __at(0x7C3A);	// @ (0xF87 * 8 + 2)
#define                                 TRISG2_bit          _BIT_ACCESS(TRISG,2)
// TRISG<TRISG3>
extern volatile __bit                   TRISG3              __at(0x7C3B);	// @ (0xF87 * 8 + 3)
#define                                 TRISG3_bit          _BIT_ACCESS(TRISG,3)
// TRISG<TRISG4>
extern volatile __bit                   TRISG4              __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 TRISG4_bit          _BIT_ACCESS(TRISG,4)
// TRISG<TRISG6>
extern volatile __bit                   TRISG6              __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 TRISG6_bit          _BIT_ACCESS(TRISG,6)
// TRISG<TRISG7>
extern volatile __bit                   TRISG7              __at(0x7C3F);	// @ (0xF87 * 8 + 7)
#define                                 TRISG7_bit          _BIT_ACCESS(TRISG,7)
// TRISH<TRISH0>
extern volatile __bit                   TRISH0              __at(0x7C40);	// @ (0xF88 * 8 + 0)
#define                                 TRISH0_bit          _BIT_ACCESS(TRISH,0)
// TRISH<TRISH1>
extern volatile __bit                   TRISH1              __at(0x7C41);	// @ (0xF88 * 8 + 1)
#define                                 TRISH1_bit          _BIT_ACCESS(TRISH,1)
// TRISH<TRISH2>
extern volatile __bit                   TRISH2              __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 TRISH2_bit          _BIT_ACCESS(TRISH,2)
// TRISH<TRISH3>
extern volatile __bit                   TRISH3              __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 TRISH3_bit          _BIT_ACCESS(TRISH,3)
// TX1STA<TRMT1>
extern volatile __bit                   TRMT1               __at(0x7CE9);	// @ (0xF9D * 8 + 1)
#define                                 TRMT1_bit           _BIT_ACCESS(TX1STA,1)
// SCANTRIG<TSEL0>
extern volatile __bit                   TSEL0               __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 TSEL0_bit           _BIT_ACCESS(SCANTRIG,0)
// SCANTRIG<TSEL1>
extern volatile __bit                   TSEL1               __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 TSEL1_bit           _BIT_ACCESS(SCANTRIG,1)
// SCANTRIG<TSEL2>
extern volatile __bit                   TSEL2               __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 TSEL2_bit           _BIT_ACCESS(SCANTRIG,2)
// SCANTRIG<TSEL3>
extern volatile __bit                   TSEL3               __at(0x7A83);	// @ (0xF50 * 8 + 3)
#define                                 TSEL3_bit           _BIT_ACCESS(SCANTRIG,3)
// FVRCON<TSEN>
extern volatile __bit                   TSEN                __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 TSEN_bit            _BIT_ACCESS(FVRCON,5)
// FVRCON<TSRNG>
extern volatile __bit                   TSRNG               __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 TSRNG_bit           _BIT_ACCESS(FVRCON,4)
// OSCTUNE<TUN0>
extern volatile __bit                   TUN0                __at(0x7240);	// @ (0xE48 * 8 + 0)
#define                                 TUN0_bit            _BIT_ACCESS(OSCTUNE,0)
// OSCTUNE<TUN1>
extern volatile __bit                   TUN1                __at(0x7241);	// @ (0xE48 * 8 + 1)
#define                                 TUN1_bit            _BIT_ACCESS(OSCTUNE,1)
// OSCTUNE<TUN2>
extern volatile __bit                   TUN2                __at(0x7242);	// @ (0xE48 * 8 + 2)
#define                                 TUN2_bit            _BIT_ACCESS(OSCTUNE,2)
// OSCTUNE<TUN3>
extern volatile __bit                   TUN3                __at(0x7243);	// @ (0xE48 * 8 + 3)
#define                                 TUN3_bit            _BIT_ACCESS(OSCTUNE,3)
// OSCTUNE<TUN4>
extern volatile __bit                   TUN4                __at(0x7244);	// @ (0xE48 * 8 + 4)
#define                                 TUN4_bit            _BIT_ACCESS(OSCTUNE,4)
// OSCTUNE<TUN5>
extern volatile __bit                   TUN5                __at(0x7245);	// @ (0xE48 * 8 + 5)
#define                                 TUN5_bit            _BIT_ACCESS(OSCTUNE,5)
// PIE3<TX1IE>
extern volatile __bit                   TX1IE               __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 TX1IE_bit           _BIT_ACCESS(PIE3,4)
// PIR3<TX1IF>
extern volatile __bit                   TX1IF               __at(0x71B4);	// @ (0xE36 * 8 + 4)
#define                                 TX1IF_bit           _BIT_ACCESS(PIR3,4)
// IPR3<TX1IP>
extern volatile __bit                   TX1IP               __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 TX1IP_bit           _BIT_ACCESS(IPR3,4)
// CK1PPS<TX1PPS0>
extern volatile __bit                   TX1PPS0             __at(0x7080);	// @ (0xE10 * 8 + 0)
#define                                 TX1PPS0_bit         _BIT_ACCESS(CK1PPS,0)
// CK1PPS<TX1PPS1>
extern volatile __bit                   TX1PPS1             __at(0x7081);	// @ (0xE10 * 8 + 1)
#define                                 TX1PPS1_bit         _BIT_ACCESS(CK1PPS,1)
// CK1PPS<TX1PPS2>
extern volatile __bit                   TX1PPS2             __at(0x7082);	// @ (0xE10 * 8 + 2)
#define                                 TX1PPS2_bit         _BIT_ACCESS(CK1PPS,2)
// CK1PPS<TX1PPS3>
extern volatile __bit                   TX1PPS3             __at(0x7083);	// @ (0xE10 * 8 + 3)
#define                                 TX1PPS3_bit         _BIT_ACCESS(CK1PPS,3)
// CK1PPS<TX1PPS4>
extern volatile __bit                   TX1PPS4             __at(0x7084);	// @ (0xE10 * 8 + 4)
#define                                 TX1PPS4_bit         _BIT_ACCESS(CK1PPS,4)
// PIE3<TX2IE>
extern volatile __bit                   TX2IE               __at(0x7166);	// @ (0xE2C * 8 + 6)
#define                                 TX2IE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<TX2IF>
extern volatile __bit                   TX2IF               __at(0x71B6);	// @ (0xE36 * 8 + 6)
#define                                 TX2IF_bit           _BIT_ACCESS(PIR3,6)
// IPR3<TX2IP>
extern volatile __bit                   TX2IP               __at(0x7116);	// @ (0xE22 * 8 + 6)
#define                                 TX2IP_bit           _BIT_ACCESS(IPR3,6)
// CK2PPS<TX2PPS0>
extern volatile __bit                   TX2PPS0             __at(0x7090);	// @ (0xE12 * 8 + 0)
#define                                 TX2PPS0_bit         _BIT_ACCESS(CK2PPS,0)
// CK2PPS<TX2PPS1>
extern volatile __bit                   TX2PPS1             __at(0x7091);	// @ (0xE12 * 8 + 1)
#define                                 TX2PPS1_bit         _BIT_ACCESS(CK2PPS,1)
// CK2PPS<TX2PPS2>
extern volatile __bit                   TX2PPS2             __at(0x7092);	// @ (0xE12 * 8 + 2)
#define                                 TX2PPS2_bit         _BIT_ACCESS(CK2PPS,2)
// CK2PPS<TX2PPS3>
extern volatile __bit                   TX2PPS3             __at(0x7093);	// @ (0xE12 * 8 + 3)
#define                                 TX2PPS3_bit         _BIT_ACCESS(CK2PPS,3)
// CK2PPS<TX2PPS4>
extern volatile __bit                   TX2PPS4             __at(0x7094);	// @ (0xE12 * 8 + 4)
#define                                 TX2PPS4_bit         _BIT_ACCESS(CK2PPS,4)
// CK2PPS<TX2PPS5>
extern volatile __bit                   TX2PPS5             __at(0x7095);	// @ (0xE12 * 8 + 5)
#define                                 TX2PPS5_bit         _BIT_ACCESS(CK2PPS,5)
// PIE4<TX3IE>
extern volatile __bit                   TX3IE               __at(0x7168);	// @ (0xE2D * 8 + 0)
#define                                 TX3IE_bit           _BIT_ACCESS(PIE4,0)
// PIR4<TX3IF>
extern volatile __bit                   TX3IF               __at(0x71B8);	// @ (0xE37 * 8 + 0)
#define                                 TX3IF_bit           _BIT_ACCESS(PIR4,0)
// IPR4<TX3IP>
extern volatile __bit                   TX3IP               __at(0x7118);	// @ (0xE23 * 8 + 0)
#define                                 TX3IP_bit           _BIT_ACCESS(IPR4,0)
// CK3PPS<TX3PPS0>
extern volatile __bit                   TX3PPS0             __at(0x70A0);	// @ (0xE14 * 8 + 0)
#define                                 TX3PPS0_bit         _BIT_ACCESS(CK3PPS,0)
// CK3PPS<TX3PPS1>
extern volatile __bit                   TX3PPS1             __at(0x70A1);	// @ (0xE14 * 8 + 1)
#define                                 TX3PPS1_bit         _BIT_ACCESS(CK3PPS,1)
// CK3PPS<TX3PPS2>
extern volatile __bit                   TX3PPS2             __at(0x70A2);	// @ (0xE14 * 8 + 2)
#define                                 TX3PPS2_bit         _BIT_ACCESS(CK3PPS,2)
// CK3PPS<TX3PPS3>
extern volatile __bit                   TX3PPS3             __at(0x70A3);	// @ (0xE14 * 8 + 3)
#define                                 TX3PPS3_bit         _BIT_ACCESS(CK3PPS,3)
// CK3PPS<TX3PPS4>
extern volatile __bit                   TX3PPS4             __at(0x70A4);	// @ (0xE14 * 8 + 4)
#define                                 TX3PPS4_bit         _BIT_ACCESS(CK3PPS,4)
// CK3PPS<TX3PPS5>
extern volatile __bit                   TX3PPS5             __at(0x70A5);	// @ (0xE14 * 8 + 5)
#define                                 TX3PPS5_bit         _BIT_ACCESS(CK3PPS,5)
// PIE4<TX4IE>
extern volatile __bit                   TX4IE               __at(0x716A);	// @ (0xE2D * 8 + 2)
#define                                 TX4IE_bit           _BIT_ACCESS(PIE4,2)
// PIR4<TX4IF>
extern volatile __bit                   TX4IF               __at(0x71BA);	// @ (0xE37 * 8 + 2)
#define                                 TX4IF_bit           _BIT_ACCESS(PIR4,2)
// IPR4<TX4IP>
extern volatile __bit                   TX4IP               __at(0x711A);	// @ (0xE23 * 8 + 2)
#define                                 TX4IP_bit           _BIT_ACCESS(IPR4,2)
// CK4PPS<TX4PPS0>
extern volatile __bit                   TX4PPS0             __at(0x70B0);	// @ (0xE16 * 8 + 0)
#define                                 TX4PPS0_bit         _BIT_ACCESS(CK4PPS,0)
// CK4PPS<TX4PPS1>
extern volatile __bit                   TX4PPS1             __at(0x70B1);	// @ (0xE16 * 8 + 1)
#define                                 TX4PPS1_bit         _BIT_ACCESS(CK4PPS,1)
// CK4PPS<TX4PPS2>
extern volatile __bit                   TX4PPS2             __at(0x70B2);	// @ (0xE16 * 8 + 2)
#define                                 TX4PPS2_bit         _BIT_ACCESS(CK4PPS,2)
// CK4PPS<TX4PPS3>
extern volatile __bit                   TX4PPS3             __at(0x70B3);	// @ (0xE16 * 8 + 3)
#define                                 TX4PPS3_bit         _BIT_ACCESS(CK4PPS,3)
// CK4PPS<TX4PPS4>
extern volatile __bit                   TX4PPS4             __at(0x70B4);	// @ (0xE16 * 8 + 4)
#define                                 TX4PPS4_bit         _BIT_ACCESS(CK4PPS,4)
// PIE4<TX5IE>
extern volatile __bit                   TX5IE               __at(0x716C);	// @ (0xE2D * 8 + 4)
#define                                 TX5IE_bit           _BIT_ACCESS(PIE4,4)
// PIR4<TX5IF>
extern volatile __bit                   TX5IF               __at(0x71BC);	// @ (0xE37 * 8 + 4)
#define                                 TX5IF_bit           _BIT_ACCESS(PIR4,4)
// IPR4<TX5IP>
extern volatile __bit                   TX5IP               __at(0x711C);	// @ (0xE23 * 8 + 4)
#define                                 TX5IP_bit           _BIT_ACCESS(IPR4,4)
// CK5PPS<TX5PPS0>
extern volatile __bit                   TX5PPS0             __at(0x70C0);	// @ (0xE18 * 8 + 0)
#define                                 TX5PPS0_bit         _BIT_ACCESS(CK5PPS,0)
// CK5PPS<TX5PPS1>
extern volatile __bit                   TX5PPS1             __at(0x70C1);	// @ (0xE18 * 8 + 1)
#define                                 TX5PPS1_bit         _BIT_ACCESS(CK5PPS,1)
// CK5PPS<TX5PPS2>
extern volatile __bit                   TX5PPS2             __at(0x70C2);	// @ (0xE18 * 8 + 2)
#define                                 TX5PPS2_bit         _BIT_ACCESS(CK5PPS,2)
// CK5PPS<TX5PPS3>
extern volatile __bit                   TX5PPS3             __at(0x70C3);	// @ (0xE18 * 8 + 3)
#define                                 TX5PPS3_bit         _BIT_ACCESS(CK5PPS,3)
// CK5PPS<TX5PPS4>
extern volatile __bit                   TX5PPS4             __at(0x70C4);	// @ (0xE18 * 8 + 4)
#define                                 TX5PPS4_bit         _BIT_ACCESS(CK5PPS,4)
// CK5PPS<TX5PPS5>
extern volatile __bit                   TX5PPS5             __at(0x70C5);	// @ (0xE18 * 8 + 5)
#define                                 TX5PPS5_bit         _BIT_ACCESS(CK5PPS,5)
// TX1STA<TX8_9>
extern volatile __bit                   TX8_9               __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 TX8_9_bit           _BIT_ACCESS(TX1STA,6)
// TX2STA<TX8_92>
extern volatile __bit                   TX8_92              __at(0x77B6);	// @ (0xEF6 * 8 + 6)
#define                                 TX8_92_bit          _BIT_ACCESS(TX2STA,6)
// TX1STA<TX91>
extern volatile __bit                   TX91                __at(0x7CEE);	// @ (0xF9D * 8 + 6)
#define                                 TX91_bit            _BIT_ACCESS(TX1STA,6)
// TX1STA<TX9D1>
extern volatile __bit                   TX9D1               __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 TX9D1_bit           _BIT_ACCESS(TX1STA,0)
// PIE3<TXB0IE>
extern volatile __bit                   TXB0IE              __at(0x7162);	// @ (0xE2C * 8 + 2)
#define                                 TXB0IE_bit          _BIT_ACCESS(PIE3,2)
// PIE3<TXB1IE>
extern volatile __bit                   TXB1IE              __at(0x7163);	// @ (0xE2C * 8 + 3)
#define                                 TXB1IE_bit          _BIT_ACCESS(PIE3,3)
// PIE3<TXB2IE>
extern volatile __bit                   TXB2IE              __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 TXB2IE_bit          _BIT_ACCESS(PIE3,4)
// PIE3<TXBNIE>
extern volatile __bit                   TXBNIE              __at(0x7164);	// @ (0xE2C * 8 + 4)
#define                                 TXBNIE_bit          _BIT_ACCESS(PIE3,4)
// PIR3<TXBNIF>
extern volatile __bit                   TXBNIF              __at(0x71B4);	// @ (0xE36 * 8 + 4)
#define                                 TXBNIF_bit          _BIT_ACCESS(PIR3,4)
// IPR3<TXBNIP>
extern volatile __bit                   TXBNIP              __at(0x7114);	// @ (0xE22 * 8 + 4)
#define                                 TXBNIP_bit          _BIT_ACCESS(IPR3,4)
// BAUD1CON<TXCKP>
extern volatile __bit                   TXCKP               __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXCKP_bit           _BIT_ACCESS(BAUD1CON,4)
// BAUD1CON<TXCKP1>
extern volatile __bit                   TXCKP1              __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXCKP1_bit          _BIT_ACCESS(BAUD1CON,4)
// BAUD2CON<TXCKP2>
extern volatile __bit                   TXCKP2              __at(0x77BC);	// @ (0xEF7 * 8 + 4)
#define                                 TXCKP2_bit          _BIT_ACCESS(BAUD2CON,4)
// TX1STA<TXD8>
extern volatile __bit                   TXD8                __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 TXD8_bit            _BIT_ACCESS(TX1STA,0)
// TX2STA<TXD82>
extern volatile __bit                   TXD82               __at(0x77B0);	// @ (0xEF6 * 8 + 0)
#define                                 TXD82_bit           _BIT_ACCESS(TX2STA,0)
// TX1STA<TXEN1>
extern volatile __bit                   TXEN1               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 TXEN1_bit           _BIT_ACCESS(TX1STA,5)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7CA1);	// @ (0xF94 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x76C1);	// @ (0xED8 * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// PMD5<UART1MD>
extern volatile __bit                   UART1MD             __at(0x728A);	// @ (0xE51 * 8 + 2)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD5,2)
// PMD5<UART2MD>
extern volatile __bit                   UART2MD             __at(0x728B);	// @ (0xE51 * 8 + 3)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD5,3)
// PMD5<UART3MD>
extern volatile __bit                   UART3MD             __at(0x728C);	// @ (0xE51 * 8 + 4)
#define                                 UART3MD_bit         _BIT_ACCESS(PMD5,4)
// PMD5<UART4MD>
extern volatile __bit                   UART4MD             __at(0x728D);	// @ (0xE51 * 8 + 5)
#define                                 UART4MD_bit         _BIT_ACCESS(PMD5,5)
// PMD5<UART5MD>
extern volatile __bit                   UART5MD             __at(0x728E);	// @ (0xE51 * 8 + 6)
#define                                 UART5MD_bit         _BIT_ACCESS(PMD5,6)
// PORTA<ULPWUIN>
